{
  "id": "biblical",
  "name": "📖 Conhecimento Bíblico",
  "description": "Explore personagens, eventos, ensinamentos e curiosidades do Antigo e Novo Testamento",
  "icon": "✝️",
  "color": "blue",
  "difficulty": "intermediate",
  "wordCount": 100,
  "categories": ["religião", "história", "cultura", "teologia"],
  "author": "Bible Study Academy",
  "createdAt": "2024-03-10T08:00:00.000Z",
  "updatedAt": "2024-03-20T16:45:00.000Z",
  "rating": 4.9,
  "reviewCount": 215,
  "terms": [
    {
      "id": "arca_001",
      "word": "ARCA DE NOÉ",
      "hint": "Construção gigante que salvou pessoas e animais de um grande dilúvio",
      "fullExplanation": "A Arca de Noé foi uma enorme embarcação construída por Noé sob orientação divina para salvar sua família e representantes de todos os animais terrestres do Dilúvio global. Segundo Gênesis 6-9, tinha dimensões de aproximadamente 133m de comprimento, 22m de largura e 13m de altura, com três andares. A arca flutuou por 150 dias até repousar nas montanhas de Ararate.",
      "funFact": "O cálculo matemático mostra que a Arca poderia abrigar cerca de 125.000 animais do tamanho de ovelhas! Considerando que apenas espécies básicas (tipos criados) precisavam ser salvas, não todos os milhões de espécies modernas, o espaço seria mais que suficiente.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["dilúvio", "animais", "salvação", "Noé", "Gênesis"],
      "imageUrl": "/images/noahs-ark.png",
      "relatedTerms": ["Dilúvio", "Aliança", "Pomba"]
    },
    {
      "id": "maná_002",
      "word": "MANÁ",
      "hint": "Alimento milagroso que caía do céu para os israelitas no deserto",
      "fullExplanation": "O maná foi o alimento providenciado por Deus aos israelitas durante seus 40 anos de peregrinação no deserto após o Êxodo do Egito. Descrito em Êxodo 16 como uma substância branca e flocosa, semelhante à semente de coentro, que aparecia no chão cada manhã (exceto no sábado). Os israelitas o coletavam e faziam bolos que tinham gosto de bolo de mel. Representava a provisão e cuidado divinos.",
      "funFact": "O maná aparecia diariamente, mas estragava se guardado para o dia seguinte (exceto na véspera do sábado). Alguns estudiosos sugerem que poderia ser uma secreção de insetos que se alimentam de tamargueiras, mas a quantidade milagrosa e as propriedades especiais indicam intervenção sobrenatural!",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["milagre", "alimento", "deserto", "Êxodo", "providência"],
      "imageUrl": "/images/manna.png",
      "relatedTerms": ["Êxodo", "Deserto", "Moíses"]
    },
    {
      "id": "decálogo_003",
      "word": "DEZ MANDAMENTOS",
      "hint": "Conjunto de leis morais dadas por Deus a Moisés no Monte Sinai",
      "fullExplanation": "Os Dez Mandamentos são os princípios éticos e religiosos fundamentais revelados por Deus a Moisés no Monte Sinai, escritos em duas tábuas de pedra. Incluem mandamentos sobre relação com Deus (não ter outros deuses, não fazer imagens, não usar o nome em vão, guardar o sábado) e relações humanas (honrar pais, não matar, não adulterar, não roubar, não mentir, não cobiçar). Formam a base da lei moral judaico-cristã.",
      "funFact": "As tábuas foram escritas pelo 'dedo de Deus' (Êxodo 31:18)! Moisés quebrou as primeiras tábuas ao ver o bezerro de ouro, mas Deus providenciou outras. Arqueólogos encontraram códigos de leis mais antigos (como o Código de Hamurabi), mas os Dez Mandamentos são únicos em sua origem divina declarada.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["lei", "moral", "Sinai", "Moisés", "aliança"],
      "imageUrl": "/images/ten-commandments.png",
      "relatedTerms": ["Moisés", "Monte Sinai", "Aliança"]
    },
    {
      "id": "jerico_004",
      "word": "JERICÓ",
      "hint": "Cidade cujas muralhas caíram após os israelitas marcharem ao seu redor",
      "fullExplanation": "Jericó foi a primeira cidade conquistada pelos israelitas ao entrarem em Canaã, sob a liderança de Josué. Seguindo instruções divinas, os israelitas marcharam ao redor da cidade uma vez por dia durante seis dias, com sete sacerdotes tocando trombetas. No sétimo dia, marcharam sete vezes, gritaram, e as muralhas desabaram milagrosamente. Apenas Raabe e sua família foram poupadas por terem protegido os espias israelitas.",
      "funFact": "Arqueólogos debatem as evidências da queda de Jericó! Alguns encontram camadas de destruição que coincidem com o período bíblico, incluindo grãos queimados (indicando destruição rápida após colheita) e muralhas que caíram para fora (incomum em ataques convencionais).",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["milagre", "conquista", "muralhas", "Josué", "trombetas"],
      "imageUrl": "/images/jericho.png",
      "relatedTerms": ["Josué", "Raabe", "Trombetas"]
    },
    {
      "id": "golias_005",
      "word": "GOLIAS",
      "hint": "Gigante filisteu derrotado por um jovem pastor com uma funda",
      "fullExplanation": "Golias era um guerreiro filisteu gigante de Gate, com cerca de 2,9m de altura, que desafiou os israelitas para um combate individual. Por 40 dias, ele intimidou o exército de Saul. Davi, um jovem pastor que levava comida a seus irmãos, aceitou o desafio confiando em Deus. Com uma funda e uma pedra, atingiu Golias na testa, derrubando-o, e depois usou a própria espada do gigante para decapitá-lo.",
      "funFact": "A armadura de Golias pesava cerca de 57kg! Sua couraça de escamas era de bronze e pesava aproximadamente 5000 siclos (57kg), e a ponta de ferro de sua lança pesava 600 siclos (6,8kg). Davi recusou a armadura de Saul porque não estava acostumado.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["gigante", "Davi", "filisteus", "funda", "coragem"],
      "imageUrl": "/images/goliath.png",
      "relatedTerms": ["Davi", "Filisteus", "Rei Saul"]
    },
    {
      "id": "salomao_006",
      "word": "SALOMÃO",
      "hint": "Rei conhecido por sua extraordinária sabedoria e julgamento justo",
      "fullExplanation": "Salomão, filho de Davi, foi o terceiro rei de Israel, conhecido principalmente por sua sabedoria extraordinária concedida por Deus. No início de seu reinado, Deus apareceu a ele em sonho e ofereceu-lhe qualquer dádiva; Salomão pediu sabedoria para governar. Seu julgamento mais famoso envolveu duas mulheres que disputavam um bebê: ele sugeriu dividi-lo ao meio, revelando a verdadeira mãe pela reação. Também escreveu Provérbios, Eclesiastes e Cânticos.",
      "funFact": "Salomão falava 3000 provérbios e compôs 1005 cânticos! Sua sabedoria atraiu visitantes de todas as nações, incluindo a Rainha de Sabá. Apesar de sua sabedoria, ele desobedeceu a Deus ao final da vida, casando com muitas mulheres estrangeiras que o levaram à idolatria.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["sabedoria", "rei", "julgamento", "templo", "proverbios"],
      "imageUrl": "/images/solomon.png",
      "relatedTerms": ["Templo de Salomão", "Rainha de Sabá", "Provérbios"]
    },
    {
      "id": "jonas_007",
      "word": "JONAS",
      "hint": "Profeta que foi engolido por um grande peixe após fugir de Deus",
      "fullExplanation": "Jonas foi um profeta enviado por Deus para pregar arrependimento à grande cidade assíria de Nínive, inimiga de Israel. Em vez de obedecer, ele fugiu de navio na direção oposta. Deus enviou uma grande tempestade, e Jonas foi lançado ao mar para acalmá-la. Um 'grande peixe' (tradicionalmente considerado uma baleia) o engoliu, onde permaneceu três dias e três noites antes de ser vomitado em terra seca. Então obedeceu e Nínive se arrependeu.",
      "funFact": "Jesus comparou sua morte e ressurreição com o sinal de Jonas! 'Pois assim como Jonas esteve três dias e três noites no ventre do grande peixe, assim o Filho do homem estará três dias e três noites no coração da terra' (Mateus 12:40).",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["profeta", "peixe", "Nínive", "arrependimento", "milagre"],
      "imageUrl": "/images/jonah.png",
      "relatedTerms": ["Nínive", "Arrependimento", "Sinal"]
    },
    {
      "id": "danieL_008",
      "word": "DANIEL",
      "hint": "Profeta que foi lançado na cova dos leões por orar a Deus",
      "fullExplanation": "Daniel era um judeu exilado na Babilônia que se tornou alto oficial. Invejoso, outros oficiais convenceram o rei Dario a decretar que por 30 dias ninguém orasse a qualquer deus ou homem exceto ao rei. Daniel continuou orando três vezes ao dia diante de sua janela aberta. Por isso foi lançado na cova dos leões, mas Deus enviou um anjo para fechar a boca dos leões. Pela manhã, Daniel foi encontrado ileso, e seus acusadores sofreram o destino que planejavam para ele.",
      "funFact": "Daniel tinha mais de 80 anos quando foi jogado na cova dos leões! Após ser salvo, continuou servindo durante o reinado de Dario e de Ciro. Arqueólogos encontraram o 'Cilindro de Ciro' que menciona políticas tolerantes similares às descritas no livro de Daniel.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["profeta", "leões", "Babilônia", "oração", "milagre"],
      "imageUrl": "/images/daniel-lions.png",
      "relatedTerms": ["Babilônia", "Dario", "Anjo"]
    },
    {
      "id": "nascimento_009",
      "word": "NATIVIDADE DE JESUS",
      "hint": "Nascimento de Jesus em Belém, com visita de pastores e magos",
      "fullExplanation": "O nascimento de Jesus ocorreu em Belém durante o reinado de Herodes, conforme profetizado. Maria e José viajaram para Belém para o censo, e Jesus nasceu numa manjedoura porque não havia lugar na estalagem. Anjos anunciaram a pastores, que foram ver o recém-nascido. Mais tarde, magos do oriente seguiram uma estrela até Jesus, trazendo ouro, incenso e mirra. Herodes, tentando matar o 'rei dos judeus', ordenou o massacre dos meninos de Belém, mas a família fugiu para o Egito.",
      "funFact": "Os magos provavelmente chegaram meses ou até 2 anos após o nascimento! A Bíblia diz que encontraram Jesus numa 'casa' (não na manjedoura) e Herodes matou meninos de até 2 anos. Tradicionalmente, 6 de janeiro (Epifania) celebra a visita dos magos.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["nascimento", "Belém", "manjedoura", "pastores", "magos"],
      "imageUrl": "/images/nativity.png",
      "relatedTerms": ["Belém", "Manjedoura", "Magi"]
    },
    {
      "id": "sermao_010",
      "word": "SERMÃO DO MONTE",
      "hint": "Famosa coleção de ensinamentos de Jesus sobre as bem-aventuranças",
      "fullExplanation": "O Sermão do Monte (Mateus 5-7) é o mais extenso e famoso discurso de Jesus, contendo os princípios fundamentais do Reino de Deus. Inclui as Bem-aventuranças ('Bem-aventurados os humildes...'), o Pai Nosso, ensinamentos sobre não julgar, a regra de ouro ('faça aos outros...'), e contrastes entre a justiça do Reino e interpretações farisaicas da Lei. Jesus ensinou de uma montanha, ecoando Moisés no Sinai, mas com autoridade própria ('Eu, porém, vos digo').",
      "funFact": "O Sermão do Monte revolucionou a ética mundial! Suas ideias sobre amor aos inimigos, não-retaliação e pureza de coração influenciaram profundamente a civilização ocidental. Mahatma Gandhi, não-cristão, estudou-o profundamente e o considerou um dos maiores documentos éticos da humanidade.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["Jesus", "ensinamento", "bem-aventuranças", "ética", "reino"],
      "imageUrl": "/images/sermon-mount.png",
      "relatedTerms": ["Bem-aventuranças", "Pai Nosso", "Jesus"]
    },
    {
      "id": "parabolas_011",
      "word": "PARÁBOLAS",
      "hint": "Histórias curtas com significado espiritual usadas por Jesus para ensinar",
      "fullExplanation": "Parábolas são narrativas alegóricas curtas que Jesus usava para ensinar verdades espirituais sobre o Reino de Deus. Incluem o Bom Samaritano (amor ao próximo), o Filho Pródigo (perdão do Pai), o Semeador (respostas diferentes à Palavra), o Joio e o Trigo (justos e ímpios coexistindo), as Dez Virgens (preparação), e muitas outras. Jesus usava elementos cotidianos (agricultura, pesca, família) para ilustrar verdades profundas, ocultas aos soberbos mas reveladas aos humildes.",
      "funFact": "Jesus contou pelo menos 46 parábolas registradas! Cerca de 35% dos ensinamentos de Jesus nos Evangelhos estão em forma parabólica. As parábolas eram memoráveis e podiam ser compreendidas em diferentes níveis - simples histórias para as multidões, mas com significados profundos para os discípulos.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["Jesus", "ensino", "histórias", "reino", "alegoria"],
      "imageUrl": "/images/parables.png",
      "relatedTerms": ["Bom Samaritano", "Filho Pródigo", "Semeador"]
    },
    {
      "id": "milagres_012",
      "word": "MILAGRES",
      "hint": "Ações sobrenaturais que demonstravam o poder e compaixão de Jesus",
      "fullExplanation": "Os milagres de Jesus eram sinais que autenticavam sua missão divina e demonstravam compaixão. Incluem curas (cego de nascença, paralítico, hemorroíssa), exorcismos (legião de demônios), milagres naturais (acalmar tempestade, andar sobre água), e ressurreições (Lázaro, filha de Jairo, filho da viúva de Naim). O primeiro milagre foi transformar água em vinho nas bodas de Caná. Jesus realizou milagres por compaixão, mas também como sinais do Reino vindouro.",
      "funFact": "Os Evangelhos registram 37 milagres específicos, mas João diz que 'muitas outras coisas Jesus fez' que não foram escritas! Os milagres eram tão numerosos que multidões o seguiam. Curiosamente, Jesus evitava publicidade excessiva sobre alguns milagres, pedindo que não fossem divulgados.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["Jesus", "sobrenatural", "cura", "sinal", "poder"],
      "imageUrl": "/images/miracles.png",
      "relatedTerms": ["Curas", "Ressurreições", "Exorcismos"]
    },
    {
      "id": "transfiguracao_013",
      "word": "TRANSFIGURAÇÃO",
      "hint": "Evento onde Jesus apareceu glorificado com Moisés e Elias",
      "fullExplanation": "A Transfiguração foi um evento onde Jesus levou Pedro, Tiago e João a um monte alto (tradicionalmente Monte Tabor) e foi transfigurado diante deles: seu rosto brilhou como o sol e suas vestes tornaram-se brancas como a luz. Moisés e Elias apareceram conversando com Jesus sobre sua partida (morte) em Jerusalém. Uma nuvem os envolveu e uma voz do céu disse: 'Este é o meu Filho amado, a ele ouvi'. Os discípulos caíram temerosos, mas Jesus os tocou dizendo 'levantem-se, não temam'.",
      "funFact": "Moisés e Elias representam a Lei e os Profetas testificando sobre Jesus! Moisés morreu e foi sepultado por Deus; Elias foi levado ao céu num redemoinho. Ambos aparecem vivos, mostrando a realidade da vida após a morte. Pedro sugeriu construir três tendas, mas a voz celestial corrigiu o foco exclusivo em Jesus.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["glória", "monte", "Moisés", "Elias", "manifestação"],
      "imageUrl": "/images/transfiguration.png",
      "relatedTerms": ["Monte Tabor", "Moisés", "Elias"]
    },
    {
      "id": "santa_ceia_014",
      "word": "ÚLTIMA CEIA",
      "hint": "Refeição final de Jesus com seus discípulos antes da crucificação",
      "fullExplanation": "A Última Ceia foi a refeição da Páscoa judaica que Jesus compartilhou com seus discípulos na véspera de sua crucificação. Durante a ceia, Jesus instituiu a Ceia do Senhor (Eucaristia/Comunhão), usando pão e vinho como símbolos de seu corpo e sangue. Lavou os pés dos discípulos como exemplo de humildade e serviço. Predisse a traição de Judas (que saiu para traí-lo) e a negação de Pedro. Ensinou extensivamente (João 13-17) e orou a oração sacerdotal.",
      "funFact": "A Última Ceia ocorreu numa sala superior emprestada! Jesus enviou Pedro e João dizendo: 'Encontrarão um homem carregando um cântaro de água; sigam-no à casa' - algo incomum, pois normalmente mulheres carregavam água. Leonardo da Vinci pintou sua famosa obra 'A Última Ceia' no refeitório de um convento em Milão.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["ceia", "Páscoa", "Eucaristia", "traição", "discípulos"],
      "imageUrl": "/images/last-supper.png",
      "relatedTerms": ["Páscoa", "Judas", "Ceia do Senhor"]
    },
    {
      "id": "getsemani_015",
      "word": "GETSÊMANI",
      "hint": "Jardim onde Jesus orou angustiado antes de ser preso",
      "fullExplanation": "O Getsêmani (hebraico: 'prensa de azeite') foi um jardim no Monte das Oliveiras onde Jesus orou intensamente antes de sua prisão. Ali, angustiado e profundamente triste, orou: 'Pai, se possível, afasta de mim este cálice; contudo, não seja como eu quero, mas como tu queres'. Seu suor tornou-se como gotas de sangue (hematidrose, possível fenômeno médico sob extremo estresse). Os discípulos dormiram enquanto ele orava. Judas o traiu com um beijo, e Jesus foi preso.",
      "funFact": "Getsêmani significa 'prensa de azeite'! Ironicamente, Jesus foi 'prensado' pela angústia ali. Algumas oliveiras no jardim atual têm mais de 900 anos e poderiam ser descendentes das árvores originais. A hematidrose (suor de sangue) mencionada por Lucas é um fenômeno médico raro mas documentado.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["oração", "angústia", "jardim", "prisão", "sacrifício"],
      "imageUrl": "/images/gethsemane.png",
      "relatedTerms": ["Monte das Oliveiras", "Judas", "Cálice"]
    },
    {
      "id": "paixao_016",
      "word": "PAIXÃO DE CRISTO",
      "hint": "Sofrimento e morte de Jesus na cruz",
      "fullExplanation": "A Paixão refere-se aos eventos finais da vida de Jesus: julgamento perante Anás, Caifás, Pilatos e Herodes; flagelação; coroação de espinhos; via dolorosa (caminho da cruz); e crucificação no Gólgota. Jesus carregou sua cruz, foi crucificado entre dois ladrões, perdoou seus executores, confiou sua mãe a João, clamou 'Deus meu, por que me desamparaste?', disse 'está consumado', e entregou seu espírito. Seu lado foi perfurado por uma lança, confirmando sua morte.",
      "funFact": "A crucificação era a pena de morte mais cruel e humilhante do Império Romano! Reservada para escravos, piratas e rebeldes políticos. O suplício podia durar dias. Jesus morreu em aproximadamente 6 horas, surpreendentemente rápido, possivelmente por choque traumático e exaustão após a flagelação.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["cruz", "sofrimento", "morte", "Gólgota", "sacrifício"],
      "imageUrl": "/images/passion.png",
      "relatedTerms": ["Crucificação", "Gólgota", "Pilatos"]
    },
    {
      "id": "ressurreicao_017",
      "word": "RESSURREIÇÃO",
      "hint": "Ressurreição de Jesus dos mortos no terceiro dia",
      "fullExplanation": "A Ressurreição de Jesus é o evento central da fé cristã: no terceiro dia após sua crucificação, no domingo de manhã, Maria Madalena e outras mulheres encontraram o túmulo vazio. Um anjo anunciou: 'Ele não está aqui; ressuscitou!'. Jesus apareceu primeiro a Maria Madalena, depois aos discípulos no cenáculo (incluindo Tomé incrédulo), a dois discípulos no caminho de Emaús, e a mais de 500 pessoas ao longo de 40 dias. Provou ser físico (comeu peixe, mostrou feridas) mas com corpo glorificado.",
      "funFact": "As primeiras testemunhas da ressurreição foram mulheres! Na cultura judaica do século I, o testemunho feminino era considerado pouco confiável em tribunais. Se os evangelistas tivessem inventado a história, teriam escolhido testemunhas masculinas mais credíveis - o fato de mencionarem mulheres é forte indício de veracidade.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["ressurreição", "túmulo vazio", "vitória", "vida", "domingo"],
      "imageUrl": "/images/resurrection.png",
      "relatedTerms": ["Túmulo Vazio", "Maria Madalena", "Aparições"]
    },
    {
      "id": "pentecostes_018",
      "word": "PENTECOSTES",
      "hint": "Descida do Espírito Santo sobre os discípulos 50 dias após Páscoa",
      "fullExplanation": "Pentecostes (grego: 'quinquagésimo') ocorreu 50 dias após a Páscoa, durante a festa judaica das Semanas. Os discípulos estavam reunidos quando houve um som como de vento impetuoso, línguas como de fogo pousaram sobre cada um, e foram cheios do Espírito Santo, começando a falar em outras línguas. Judeus de muitas nações os ouviam falar em suas línguas nativas. Pedro pregou e cerca de 3000 pessoas se converteram, marcando o nascimento da Igreja.",
      "funFact": "Pentecostes reverteu Babel! Em Babel, Deus confundiu as línguas para dispersar a humanidade arrogante. Em Pentecostes, o Espírito permitiu comunicação sobrenatural para unir povos no evangelho. Curiosamente, a festa de Pentecostes judaica celebrava a entrega da Lei no Sinai - agora o Espírito escreve a lei nos corações!",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["Espírito Santo", "Igreja", "línguas", "poder", "nascimento"],
      "imageUrl": "/images/pentecost.png",
      "relatedTerms": ["Espírito Santo", "Línguas", "Igreja Primitiva"]
    },
    {
      "id": "conversao_paulo_019",
      "word": "CONVERSÃO DE PAULO",
      "hint": "Encontro dramático com Jesus ressurreto a caminho de Damasco",
      "fullExplanation": "Saulo (depois Paulo) era fariseu perseguidor dos cristãos, a caminho de Damasco para prender seguidores de Jesus. De repente, uma luz do céu o cercou, e ele caiu por terra ouvindo uma voz: 'Saulo, Saulo, por que me persegues?'. Era Jesus ressurreto. Saulo ficou cego por três dias até que Ananias, obedecendo a uma visão, o visitou e impôs as mãos, restaurando sua visão e batizando-o. Saulo tornou-se o maior missionário e teólogo do cristianismo primitivo.",
      "funFact": "Paulo escreveu 13 cartas do Novo Testamento (quase metade)! Antes perseguidor, tornou-se 'apóstolo dos gentios'. Sua experiência ocorreu por volta de 34-36 d.C. O local tradicional fica na 'Reta' (Via Recta) em Damasco. Ele se descreveu como 'nascido fora de tempo' quanto ao apostolado.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["conversão", "Paulo", "Damasco", "perseguidor", "missionário"],
      "imageUrl": "/images/paul-conversion.png",
      "relatedTerms": ["Damasco", "Ananias", "Apóstolo Paulo"]
    },
    {
      "id": "apocalipse_020",
      "word": "APOCALIPSE",
      "hint": "Livro final da Bíblia com visões proféticas do fim dos tempos",
      "fullExplanation": "O Apocalipse (Revelação) é o último livro da Bíblia, escrito pelo apóstolo João exilado na ilha de Patmos. Contém visões simbólicas sobre o conflito cósmico entre Deus e o mal, a vitória final de Cristo, julgamento, nova criação, e a vinda da Nova Jerusalém. Inclui sete selos, sete trombetas, sete taças, a Besta, o número 666, o Milênio, e a visão final do novo céu e nova terra. Escrito em código para cristãos perseguidos sob Domiciano.",
      "funFact": "Apocalipse tem 404 versículos contendo mais de 800 alusões ao Antigo Testamento! É o livro mais citado do AT no NT, especialmente Daniel, Ezequiel e Isaías. O número 7 aparece 54 vezes - perfeição divina. Fechado com maldição para quem acrescentar ou tirar algo das profecias.",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["profecia", "fim dos tempos", "visões", "simbolismo", "vitória"],
      "imageUrl": "/images/revelation.png",
      "relatedTerms": ["Profecia", "Nova Jerusalém", "Milênio"]
    },
    {
      "id": "arca_alianca_021",
      "word": "ARCA DA ALIANÇA",
      "hint": "Baú sagrado que continha as tábuas da lei e representava a presença de Deus",
      "fullExplanation": "A Arca da Aliança era um baú de madeira de acácia revestido de ouro, com tampa de ouro (propiciatório) e dois querubins. Continha as duas tábuas da lei, o vaso de maná e a vara de Arão que floresceu. Representava o trono e presença de Deus entre Israel. Transportada com varas pelos levitas, precedia o povo no deserto. Ficava no Santo dos Santos do Tabernáculo e depois do Templo. Seu poder manifestava-se em eventos como a queda dos muros de Jericó.",
      "funFact": "A Arca desapareceu da história após o exílio babilônico! Possíveis destinos: escondida por Jeremias, levada para a Etiópia (segundo a tradição etíope), destruída por Nabucodonosor, ou escondida sob o Monte do Templo. Indiana Jones popularizou a busca pela Arca no cinema!",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["sagrado", "presença", "tabernáculo", "templo", "aliança"],
      "imageUrl": "/images/ark-covenant.png",
      "relatedTerms": ["Tabernáculo", "Propiciatório", "Santo dos Santos"]
    },
    {
      "id": "torre_babel_022",
      "word": "TORRE DE BABEL",
      "hint": "Construção ambiciosa que resultou na confusão das línguas",
      "fullExplanation": "Após o Dilúvio, os descendentes de Noé migraram para a planície de Sinar (Babilônia) e decidiram construir uma cidade com uma torre que chegasse ao céu, para fazer um nome para si mesmos e evitar dispersão. Deus confundiu suas línguas para que não se entendessem, dispersando-os sobre a terra. A cidade foi chamada Babel (confusão). O relato explica a origem das diferentes línguas e nações, e critica o orgulho humano autossuficiente.",
      "funFact": "Babel significa 'porta dos deuses' em acadiano, mas soa como o hebraico 'balal' (confundir)! Zigurates babilônicos eram torres-templos escalonadas similares à descrição. O Etemenanki era o zigurate da Babilônia dedicado a Marduque, possivelmente inspirando a história.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["construção", "línguas", "orgulho", "dispersão", "Babilônia"],
      "imageUrl": "/images/babel.png",
      "relatedTerms": ["Línguas", "Dispersão", "Babilônia"]
    },
    {
      "id": "sodoma_023",
      "word": "SODOMA E GOMORRA",
      "hint": "Cidades destruídas por fogo e enxofre devido à sua grave imoralidade",
      "fullExplanation": "Sodoma e Gomorra eram cidades da planície do Jordão conhecidas por grave pecado, especialmente falta de hospitalidade e imoralidade sexual. Deus decidiu destruí-las, mas Abraão intercedeu, obtendo promessa de poupá-las se houvesse apenas 10 justos. Anjos visitaram Ló em Sodoma, foram ameaçados por uma multidão, e resgataram Ló e sua família antes da destruição. Fogo e enxofre caíram do céu, destruindo as cidades completamente. A mulher de Ló olhou para trás e virou estátua de sal.",
      "funFact": "Possíveis localizações são no Mar Morto, onde evidências geológicas mostram destruição por terremoto e incêndios de enxofre natural! A área tem depósitos de betume (asfalto) e sal. 'Mulher de Ló' tornou-se expressão para quem olha nostalgicamente para um passado pecaminoso.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["destruição", "fogo", "juízo", "Ló", "intercessão"],
      "imageUrl": "/images/sodom.png",
      "relatedTerms": ["Ló", "Abraão", "Mar Morto"]
    },
    {
      "id": "jose_024",
      "word": "JOSÉ",
      "hint": "Filho de Jacó vendido como escravo que se tornou governador do Egito",
      "fullExplanation": "José, filho favorito de Jacó, teve sonhos proféticos de que família se curvaria a ele. Invejados, seus irmãos o venderam a mercadores ismaelitas que o levaram ao Egito como escravo. Na casa de Potifar, foi falsamente acusado pela esposa e preso. Na prisão, interpretou sonhos do copeiro e padeiro. Finalmente interpretou o sonho do Faraó sobre sete anos de fartura seguidos de sete de fome, sendo nomeado governador do Egito. Salvou o Egito e sua família durante a fome, reconciliando-se com os irmãos.",
      "funFact": "José é um tipo de Cristo! Ambos foram amados pelo pai, rejeitados pelos irmãos, vendidos por prata, sofreram injustamente, foram exaltados após sofrimento, e salvaram outros. José governou no Egito aos 30 anos (idade aproximada de Jesus ao começar seu ministério).",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["sonhos", "Egito", "escravo", "governador", "reconciliação"],
      "imageUrl": "/images/joseph.png",
      "relatedTerms": ["Sonhos", "Faraó", "Jacó"]
    },
    {
      "id": "moises_025",
      "word": "MOISÉS",
      "hint": "Líder que libertou Israel do Egito e recebeu a Lei no Sinai",
      "fullExplanation": "Moisés, hebreu criado como príncipe egípcio, fugiu após matar um egípcio. Encontrou Deus na sarça ardente que não se consumia, sendo comissionado para libertar Israel. Com Aarão, desafiou Faraó com pragas, culminando na Páscoa e travessia do Mar Vermelho. Conduziu Israel por 40 anos no deserto, recebeu os Dez Mandamentos no Sinai, intercedeu pelo povo rebelde, e viu a Terra Prometida de longe, morrendo no Monte Nebo aos 120 anos. Escreveu o Pentateuco (Torá).",
      "funFact": "Moisés tinha defeito de fala! 'Não sou eloquente... sou pesado de boca e pesado de língua' (Êxodo 4:10). Deus designou Aarão como seu porta-voz. Ainda assim, Moisés tornou-se o maior profeta de Israel. Sua sepultura nunca foi encontrada (Deuteronômio 34:6).",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["libertador", "profeta", "Sinai", "Êxodo", "lei"],
      "imageUrl": "/images/moses.png",
      "relatedTerms": ["Êxodo", "Dez Mandamentos", "Mar Vermelho"]
    },
    {
      "id": "sansao_026",
      "word": "SANSÃO",
      "hint": "Juiz com força sobrenatural ligada ao seu cabelo não cortado",
      "fullExplanation": "Sansão foi o décimo segundo juiz de Israel, nazireu desde o ventre, com força extraordinária concedida pelo Espírito. Lutou sozinho contra filisteus usando uma queixada de jumento, pegou tochas em raposas para incendiar campos, arrancou portas de Gaza. Apaixonou-se por Dalila, que descobriu que sua força vinha de nunca cortar o cabelo (voto nazireu). Após cortar o cabelo, foi capturado, cegado e escravizado. Seu cabelo cresceu e, numa festa filisteia, derrubou o templo matando mais na morte que na vida.",
      "funFact": "Sansão quebrou pelo menos três votos nazireus! Tocou cadáver (queixada), participou de banquete (provavelmente com vinho), e permitiu cortar cabelo. Sua força vinha do Espírito, não magicamente do cabelo. Julgou Israel por 20 anos.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["força", "nazireu", "filisteus", "Dalila", "juiz"],
      "imageUrl": "/images/samson.png",
      "relatedTerms": ["Dalila", "Nazireu", "Filisteus"]
    },
    {
      "id": "rute_027",
      "word": "RUTE",
      "hint": "Moabita leal que se tornou ancestral do rei Davi e de Jesus",
      "fullExplanation": "Rute era uma moabita que, após a morte de seu marido israelita, recusou-se a abandonar sua sogra Noemi, dizendo: 'Aonde quer que fores, irei; onde quer que pousares, pousarei; o teu povo será o meu povo, e o teu Deus será o meu Deus'. Voltou a Belém com Noemi, respigou nos campos de Boaz, seu parente-resgatador. Seguindo orientação de Noemi, pediu a Boaz que a resgatasse. Boaz se casou com ela, tornando-se bisavó do rei Davi, incluída na genealogia de Jesus.",
      "funFact": "Rute é uma das quatro mulheres mencionadas na genealogia de Jesus (Mateus 1)! As outras são Tamar, Raabe e Bate-Seba - todas com histórias incomuns. Rute demonstra que gentios eram parte do plano redentor desde o início. Seu livro é lido na festa judaica de Shavuot (Pentecostes).",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["lealdade", "ancestral", "Boaz", "Noemi", "resgatador"],
      "imageUrl": "/images/ruth.png",
      "relatedTerms": ["Boaz", "Noemi", "Parente-Resgatador"]
    },
    {
      "id": "elias_028",
      "word": "ELIAS",
      "hint": "Profeta que enfrentou os profetas de Baal e foi levado ao céu num redemoinho",
      "fullExplanation": "Elias foi um profeta durante o reinado de Acabe e Jezabel em Israel. Predisse uma seca de três anos e meio, foi sustentado por corvos e uma viúva de Sarepta. No Monte Carmelo, desafiou 450 profetas de Baal: ambos preparariam um altar; o deus que respondesse com fogo seria o verdadeiro. Baal não respondeu; o fogo de Deus consumiu o altar de Elias até a água no rego. Elias matou os profetas de Baal, fugiu de Jezabel, ouviu Deus num cicio suave, ungiu Eliseu como sucessor, e foi levado ao céu num redemoinho.",
      "funFact": "Elias apareceu com Moisés na Transfiguração de Jesus! Representando os profetas, conversou com Jesus sobre sua partida (morte). Os judeus aguardam seu retorno antes do Messias (Malaquias 4:5). Na Páscoa judaica, deixam um copo de vinho para Elias.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "Carmelo", "fogo", "Baal", "arrebatamento"],
      "imageUrl": "/images/elijah.png",
      "relatedTerms": ["Monte Carmelo", "Baal", "Eliseu"]
    },
    {
      "id": "neemias_029",
      "word": "NEEMIAS",
      "hint": "Copeiro do rei que reconstruiu os muros de Jerusalém em 52 dias",
      "fullExplanation": "Neemias era copeiro do rei persa Artaxerxes I em Susã. Ao saber que Jerusalém estava em ruínas e seus muros destruídos, chorou, orou e pediu ao rei permissão para reconstruí-los. Como governador, enfrentou oposição de Sambalate e Tobias, organizou o povo por famílias para reconstruir seções específicas, metade trabalhava e metade guardava com armas. Concluiu os muros em 52 dias apesar de ameaças. Promoveu reformas religiosas com Esdras, restabelecendo a Lei e a pureza do culto.",
      "funFact": "Neemias usou uma estratégia militar inteligente: trabalhadores com uma mão na construção e outra na espada! O livro é rico em orações curtas ('Lembra-te de mim, ó Deus'). Arqueologia confirma a existência de Sambalate, governador de Samaria, em papiros elefantinos.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["reconstrução", "muros", "Jerusalém", "oração", "liderança"],
      "imageUrl": "/images/nehemiah.png",
      "relatedTerms": ["Jerusalém", "Esdras", "Muros"]
    },
    {
      "id": "job_030",
      "word": "JÓ",
      "hint": "Homem justo que perdeu tudo mas manteve sua fé em Deus",
      "fullExplanation": "Jó era um homem íntegro e reto, muito rico, que temia a Deus. Satanás acusou que Jó só o servia por causa das bênçãos. Com permissão divina, Jó perdeu filhos, riquezas e saúde, ficando coberto de úlceras. Sua esposa sugeriu que amaldiçoasse a Deus; três amigos (Elifaz, Bildade, Zofar) argumentaram que seu sofrimento era castigo por pecado. Jó manteve integridade, questionando mas não amaldiçoando Deus. Deus respondeu do redemoinho, mostrando sua sabedoria e poder. No final, Jó é restaurado com o dobro.",
      "funFact": "Jó possivelmente viveu na era patriarcal (contemporâneo de Abraão)! O livro não menciona lei mosaica, templo ou Israel. É considerado obra-prima da literatura mundial sobre o problema do sofrimento. A frase 'Bem sei que meu Redentor vive' (19:25) é famosa na música sacra.",
      "difficulty": "advanced",
      "category": "Antigo Testamento",
      "tags": ["sofrimento", "fé", "sabedoria", "Satanás", "restauração"],
      "imageUrl": "/images/job.png",
      "relatedTerms": ["Sofrimento", "Sabedoria", "Redentor"]
    },
    {
      "id": "salmo_023_031",
      "word": "SALMO 23",
      "hint": "Salmo mais famoso que começa 'O Senhor é meu pastor, nada me faltará'",
      "fullExplanation": "O Salmo 23, atribuído a Davi, é o mais conhecido e amado dos Salmos. Usa a metáfora do pastor (Deus) e ovelhas (crentes) para expressar confiança na provisão, direção, proteção e cuidado divinos em todas as circunstâncias, incluindo 'vale da sombra da morte'. Reflete experiência de Davi como pastor de ovelhas antes de ser rei. O salmo termina com confiança na bondade e misericórdia que seguirão o crente 'todos os dias da vida', e na habitação eterna na casa do Senhor.",
      "funFact": "O Salmo 23 tem apenas 118 palavras na versão hebraica! Foi traduzido para praticamente todos os idiomas. É recitado em funerais, momentos de crise, e memorizado por milhões. O 'vale da sombra da morte' refere-se a desfiladeiros escuros na Palestina onde ovelhas podiam ser atacadas.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["salmo", "pastor", "confiança", "proteção", "Davi"],
      "imageUrl": "/images/psalm23.png",
      "relatedTerms": ["Davi", "Pastor", "Salmos"]
    },
    {
      "id": "isaias_053_032",
      "word": "ISAÍAS 53",
      "hint": "Capítulo profético sobre o 'Servo Sofredor' que carrega nossos pecados",
      "fullExplanation": "Isaías 53 é uma das mais detalhadas profecias messiânicas do Antigo Testamento, descrevendo o 'Servo do Senhor' que sofreria pelos pecados do povo. Inclui: 'foi traspassado pelas nossas transgressões', 'como cordeiro foi levado ao matadouro', 'pelas suas pisaduras fomos sarados', 'ele não abriu a boca' (silêncio ante acusações), 'com o rico na sua morte' (sepultamento em túmulo rico). Cristãos veem cumprimento perfeito em Jesus: rejeição, sofrimento inocente, morte substitutiva, ressurreição e exaltação.",
      "funFact": "Os Manuscritos do Mar Morto incluem um rolo completo de Isaías 1000 anos mais antigo que cópias anteriores, confirmando a antiguidade da profecia! Judeus tradicionais interpretam como referindo-se a Israel coletivamente, mas muitos rabinos medievais reconheciam aplicação messiânica.",
      "difficulty": "advanced",
      "category": "Antigo Testamento",
      "tags": ["profecia", "Messias", "sofrimento", "expiação", "Servo"],
      "imageUrl": "/images/isaiah53.png",
      "relatedTerms": ["Profecia Messiânica", "Servo Sofredor", "Expiação"]
    },
    {
      "id": "ezequiel_037_033",
      "word": "VALE DE OSSOS SECOS",
      "hint": "Visão de Ezequiel sobre ossos que revivem como exército",
      "fullExplanation": "Ezequiel 37 descreve uma visão onde Deus leva o profeta a um vale cheio de ossos secos. Deus pergunta: 'Poderão reviver estes ossos?'. Ezequiel responde: 'Senhor Deus, tu o sabes'. Deus ordena que profetize aos ossos: ouvem-se ruídos, os ossos se juntam, cobrem-se de tendões, carne e pele, mas sem fôlego. Então profetiza ao vento (espírito), e o fôlego de vida entra neles, levantando-se um exército vivo. A visão simboliza a restauração nacional e espiritual de Israel após o exílio.",
      "funFact": "Esta visão inspirou o espiritual negro 'Dem Bones' (Dry Bones) e o hino 'Ressuscita!'! Tornou-se símbolo de avivamento espiritual. No contexto, Israel estava exilado na Babilônia, sem esperança - como ossos secos. A visão prometia restauração física e espiritual.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["visão", "restauração", "ressurreição", "Israel", "espírito"],
      "imageUrl": "/images/dry-bones.png",
      "relatedTerms": ["Ezequiel", "Restauração", "Espírito"]
    },
    {
      "id": "davi_034",
      "word": "DAVI",
      "hint": "Rei pastor de Israel que matou Golias e escreveu muitos salmos",
      "fullExplanation": "Davi, filho mais novo de Jessé, foi ungido rei por Samuel enquanto pastor. Matou Golias, serviu na corte de Saul, fugiu de sua perseguição por anos. Tornou-se rei de Judá em Hebrom e depois de todo Israel, conquistando Jerusalém e trazendo a Arca. Cometeu adultério com Bate-Seba e arranjou a morte de Urias, sendo confrontado por Natã. Arrependeu-se profundamente (Salmo 51). Teve filho com Bate-Seba, Salomão, que construiu o Templo. Considerado rei ideal, ancestral do Messias, autor de 73 salmos.",
      "funFact": "Davi era ruivo e de belos olhos! (1 Samuel 16:12). Tocava harpa para acalmar Saul. Viveu por volta de 1040-970 a.C. Arqueologia confirma a 'Casa de Davi' na estela de Tel Dan. Jesus é chamado 'Filho de Davi' 16 vezes nos Evangelhos.",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["rei", "pastor", "salmo", "Jerusalém", "Messias"],
      "imageUrl": "/images/david.png",
      "relatedTerms": ["Salmo 51", "Bate-Seba", "Jerusalém"]
    },
    {
      "id": "salmo_051_035",
      "word": "SALMO 51",
      "hint": "Salmo de arrependimento de Davi após o pecado com Bate-Seba",
      "fullExplanation": "Salmo 51 é o clássico salmo de confissão e arrependimento, escrito por Davi após o profeta Natã confrontá-lo sobre adultério com Bate-Seba e morte de Urias. Inclui frases famosas: 'Cria em mim, ó Deus, um coração puro', 'Não me lances fora da tua presença', 'O sacrifício aceitável a Deus é o espírito quebrantado'. Mostra arrependimento genuíno: reconhecimento da ofensa contra Deus ('contra ti, contra ti somente pequei'), pedido de purificação ('purifica-me com hissopo'), e desejo de restauração para testemunhar a outros.",
      "funFact": "Davi pede \"não tires de mim o teu Espírito Santo\" - referência explícita ao Espírito no AT! O \"hissopo\" era planta usada na Páscoa para aplicar sangue nos umbrais (Êxodo 12:22), símbolo de purificação. Este salmo é usado no Dia da Expiação (Yom Kippur).",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["arrependimento", "confissão", "perdão", "purificação", "Davi"],
      "imageUrl": "/images/psalm51.png",
      "relatedTerms": ["Arrependimento", "Perdão", "Natã"]
    },
    {
      "id": "cantico_036",
      "word": "CÂNTICO DOS CÂNTICOS",
      "hint": "Livro poético sobre amor romântico entre um homem e uma mulher",
      "fullExplanation": "Cântico dos Cânticos (em hebraico: 'A maior das canções') é uma coleção de poemas de amor entre um homem (amado) e uma mulher (amada), com coro como interlocutor. Descreve de forma vívida e sensual o desejo mútuo, a beleza física, a busca e o encontro. Tradicionalmente interpretado como alegoria do amor entre Deus e Israel (judaísmo) ou Cristo e a Igreja (cristianismo), mas também valorizado como celebração do amor conjugal heterossexual. Atribuído a Salomão, reflete a cultura de corte real.",
      "funFact": "É o único livro da Bíblia que não menciona Deus explicitamente! Os rabinos debateram sua inclusão no cânon. Contém descrições botânicas detalhadas (flores, especiarias, frutas) da Palestina. A frase 'o amor é forte como a morte' (8:6) é frequentemente citada em casamentos.",
      "difficulty": "advanced",
      "category": "Antigo Testamento",
      "tags": ["amor", "poesia", "casamento", "alegoria", "Salomão"],
      "imageUrl": "/images/song-songs.png",
      "relatedTerms": ["Amor", "Salomão", "Poesia"]
    },
    {
      "id": "proverbios_037",
      "word": "PROVÉRBIOS",
      "hint": "Coleção de ditados sábios sobre vida prática e moral",
      "fullExplanation": "Provérbios é um livro de sabedoria prática atribuído principalmente a Salomão, composto de breves ditados, instruções e poemas. Ensina como viver com retidão, prudência, disciplina e temor do Senhor. Abrange relações familiares, trabalho, finanças, amizade, fala, vícios, e caráter. Personifica a Sabedoria como mulher que clama nas ruas, contrastando com a mulher estranha (prostituta/adultera). O tema central: 'O temor do Senhor é o princípio da sabedoria'. Oferece instrução para jovens e reflexão para maduros.",
      "funFact": "Salomão compôs 3000 provérbios (1 Reis 4:32)! O livro atual contém apenas uma seleção. Provérbios 31 descreve a 'mulher virtuosa' (eshet chayil), lido pelos judeus no shabbat. Provérbios 22:6 ('Ensina a criança no caminho...') é princípio da educação cristã.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["sabedoria", "provérbio", "vida", "moral", "Salomão"],
      "imageUrl": "/images/proverbs.png",
      "relatedTerms": ["Sabedoria", "Salomão", "Temor do Senhor"]
    },
    {
      "id": "eclesiastes_038",
      "word": "ECLESIASTES",
      "hint": "Livro filosófico que conclui 'tudo é vaidade' exceto temer a Deus",
      "fullExplanation": "Eclesiastes ('Pregador') é um livro de reflexão filosófica atribuído a 'Filho de Davi, rei em Jerusalém' (Salomão). Explora o significado da vida através da lente da experiência humana: trabalho, prazer, sabedoria, riqueza, poder, tudo é 'vaidade' (hebel: vapor, futilidade) debaixo do sol. A vida é cíclica, a morte iguala todos, o esforço parece inútil. Conclui que, face à absurdidade, devemos temer a Deus e guardar seus mandamentos, pois Ele trará tudo a juízo. Inclui 'há tempo para todo propósito' (cap. 3).",
      "funFact": "Eclesiastes ecoa o existencialismo moderno! Favorito de muitos céticos intelectuais. A palavra 'vaidade' aparece 37 vezes. O livro termina com colofão editoral: 'De tudo o que se tem ouvido, o fim é: Teme a Deus e guarda os seus mandamentos; porque isto é o dever de todo homem'.",
      "difficulty": "advanced",
      "category": "Antigo Testamento",
      "tags": ["filosofia", "vaidade", "sentido", "vida", "Salomão"],
      "imageUrl": "/images/ecclesiastes.png",
      "relatedTerms": ["Vaidade", "Salomão", "Sentido da Vida"]
    },
    {
      "id": "jeremias_039",
      "word": "JEREMIAS",
      "hint": "Profeta 'chorão' que predisse a destruição de Jerusalém e novo pacto",
      "fullExplanation": "Jeremias profetizou durante os últimos 40 anos do reino de Judá antes do exílio babilônico. Predisse a destruição de Jerusalém por Nabucodonosor, chamando ao arrependimento. Conhecido como 'profeta chorão' por sua angústia (Lamentações). Enfrentou oposição, foi preso, jogado em cisterna. Comprou um campo em Anatote como sinal de esperança na restauração. Profetizou a nova aliança: 'Porei minha lei no seu interior, e a escreverei no seu coração' (31:33). Viu Judá cair, mas sobreviveu e foi para o Egito.",
      "funFact": "Jeremias era jovem quando chamado ('não passo de uma criança')! Seu secretário Baruque escreveu seus oráculos. O termo 'jeremiada' vem dele, significando lamentação longa. As 'Confissões de Jeremias' (cap. 11-20) mostram sua luta interior com a vocação.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "julgamento", "nova aliança", "lamentação", "exílio"],
      "imageUrl": "/images/jeremiah.png",
      "relatedTerms": ["Nova Aliança", "Lamentações", "Baruque"]
    },
    {
      "id": "lamentacoes_040",
      "word": "LAMENTAÇÕES",
      "hint": "Cinpo poemas fúnebres sobre a destruição de Jerusalém",
      "fullExplanation": "Lamentações é uma coleção de cinco poemas acrósticos (cada versículo começa com letra sucessiva do alfabeto hebraico) que choram a destruição de Jerusalém por Nabucodonosor em 586 a.C. Descreve vividamente a fome, violência, humilhação e desolação da cidade outrora bela ('Como está sentada solitária a cidade outrora populosa!'). Atribuído a Jeremias, reflete sua tristeza profunda. Mesmo na dor, há esperança: 'As misericórdias do Senhor são a causa de não sermos consumidos' (3:22-23).",
      "funFact": "Lamentações é lido anualmente pelos judeus no Tisha B'Av (9 de Av), dia que relembra a destruição do Templo! Os capítulos 1, 2, 4 e 5 têm 22 versículos cada (alfabeto hebraico); capítulo 3 tem 66 versículos (três para cada letra).",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["lamento", "Jerusalém", "destruição", "poesia", "Jeremias"],
      "imageUrl": "/images/lamentations.png",
      "relatedTerms": ["Jeremias", "Jerusalém", "Exílio"]
    },
    {
      "id": "osias_041",
      "word": "OSÉIAS",
      "hint": "Profeta cujo casamento com uma prostituta simbolizava a infidelidade de Israel",
      "fullExplanation": "Oséias profetizou no reino do Norte (Israel) antes da queda à Assíria. Deus ordenou que se casasse com Gomer, uma mulher de prostituições, como ilustração viva da relação de Deus com Israel infiel. Tiveram três filhos com nomes simbólicos: Jezreel (julgamento), Lo-Ruama (Não Compadecida), Lo-Ami (Não Meu Povo). Gomer o traiu, foi vendida como escrava, e Oséias a comprou de volta, restaurando-a - imagem do perdão divino. Mensagem: Israel prostituiu-se com deuses estrangeiros, mas Deus ama com amor eterno.",
      "funFact": "Oséias é o único profeta de Israel (Reino do Norte) cujas palavras foram preservadas na Bíblia! O comando 'Vai, toma uma mulher de prostituições' foi provavelmente uma visão profética, não necessariamente literal. O livro termina com apelo ao arrependimento e promessa de cura.",
      "difficulty": "advanced",
      "category": "Antigo Testamento",
      "tags": ["profeta", "casamento", "infidelidade", "amor", "restauração"],
      "imageUrl": "/images/hosea.png",
      "relatedTerms": ["Gomer", "Aliança Matrimonial", "Restauração"]
    },
    {
      "id": "joel_042",
      "word": "JOEL",
      "hint": "Profeta da praga de gafanhotos e derramamento do Espírito",
      "fullExplanation": "Joel descreve uma devastadora praga de gafanhotos como julgamento divino ('o dia do Senhor'), chamando ao arrependimento com jejum e lamento. Promete restauração após arrependimento: 'restituir-vos-ei os anos que foram consumidos pelo gafanhoto'. Profetiza um grande derramamento do Espírito sobre toda a carne, com sonhos, visões e profecias, antecedendo 'o dia grande e terrível do Senhor'. Pedro citou essa profecia no Pentecostes (Atos 2), identificando seu cumprimento inicial.",
      "funFact": "A praga de gafanhotos em Joel é descrita em quatro fases provavelmente referentes a estágios de desenvolvimento do gafanhoto ou diferentes espécies! A frase 'derramarei do meu Espírito' inspirou movimentos pentecostais e carismáticos. Joel promete que 'até sobre os servos e servas' derramaria o Espírito.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "gafanhotos", "Espírito Santo", "arrependimento", "Pentecostes"],
      "imageUrl": "/images/joel.png",
      "relatedTerms": ["Gafanhotos", "Derramamento do Espírito", "Pentecostes"]
    },
    {
      "id": "amós_043",
      "word": "AMÓS",
      "hint": "Pastor de ovelhas que profetizou contra injustiça social e ritualismo vazio",
      "fullExplanation": "Amós era boiadeiro e cultivador de sicômoros de Judá, mas enviado a profetizar em Israel (Reino do Norte). Denunciou a opressão dos pobres, corrupção dos ricos, falsa segurança religiosa e ritualismo sem justiça. Anunciou julgamento sobre nações vizinhas e Israel. Usou imagens vívidas: cesto de frutos de verão, prumo. Condenou aqueles que 'vendem o justo por prata e o necessitado por um par de sandálias'. Apesas do julgamento, termina com promessa de restauração do 'tabernáculo caído de Davi'.",
      "funFact": "Amós é considerado o primeiro profeta escritor! Não era de família profética ('não era profeta nem filho de profeta'). Sua mensagem social é tão relevante hoje. A frase 'corram as águas do juízo, e a justiça como ribeiro perene' (5:24) foi usada por Martin Luther King Jr.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "justiça social", "julgamento", "pobres", "restauração"],
      "imageUrl": "/images/amos.png",
      "relatedTerms": ["Justiça Social", "Julgamento", "Restauração"]
    },
    {
      "id": "jonas_real_044",
      "word": "JONAS",
      "hint": "Profeta relutante que pregou a Nínive resultando em arrependimento maciço",
      "fullExplanation": "Jonas recebeu ordem para pregar julgamento a Nínive, capital da Assíria (inimiga de Israel). Fugiu para Társis (Espanha), foi jogado ao mar durante tempestade, engolido por grande peixe, orou no ventre, foi vomitado em terra. Pregou simples mensagem: 'Ainda quarenta dias, e Nínive será destruída'. Contrariamente às expectativas, toda a cidade, do rei ao povo, jejuou e se arrependeu em sacos e cinzas. Deus poupou a cidade. Jonas ficou irado, preocupado com sua reputação. Deus ensinou-lhe compaixão.",
      "funFact": "Nínive era enorme: 'cidade de três dias de jornada'! Arqueologia confirma sua grandeza sob Senaqueribe. O arrependimento de Nínive contrasta com a dureza de Israel. Jesus usou Nínive para condenar geração incrédula (Mateus 12:41).",
      "difficulty": "easy",
      "category": "Antigo Testamento",
      "tags": ["profeta", "Nínive", "arrependimento", "compaixão", "peixe"],
      "imageUrl": "/images/jonah-prophet.png",
      "relatedTerms": ["Nínive", "Arrependimento", "Compaixão Divina"]
    },
    {
      "id": "miqueias_045",
      "word": "MIQUEIAS",
      "hint": "Profeta que predisse o nascimento do Messias em Belém",
      "fullExplanation": "Miqueias, contemporâneo de Isaías, profetizou a Judá sobre julgamento por corrupção, idolatria e injustiça dos líderes. Anunciou destruição de Samaria e Jerusalém, mas também restauração futura. Famosa profecia: 'E tu, Belém Efrata, pequena demais entre os milhares de Judá, de ti me sairá o que será governante em Israel' (5:2), cumprida no nascimento de Jesus. Definiu verdadeira religião: 'Ele te declarou, ó homem, o que é bom; e que é o que o Senhor pede de ti, senão que pratiques a justiça, e ames a misericórdia, e andes humildemente com o teu Deus?' (6:8).",
      "funFact": "Miqueias 5:2 é citado pelos principais sacerdotes quando Herodes pergunta onde nasceria o Cristo (Mateus 2:6)! A frase 'andares humildemente com Deus' resume a vida piedosa. Miqueias viu esperança além do julgamento: 'Quem, ó Deus, é semelhante a ti?' (7:18).",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "Belém", "Messias", "justiça", "humildade"],
      "imageUrl": "/images/micah.png",
      "relatedTerms": ["Belém", "Messias", "Justiça"]
    },
    {
      "id": "naum_046",
      "word": "NAUM",
      "hint": "Profeta que anunciou a destruição de Nínive 100 anos após seu arrependimento",
      "fullExplanation": "Naum profetizou a queda de Nínive, capital da Assíria, que ocorreu em 612 a.C. Cerca de 100 anos após o arrependimento sob a pregação de Jonas, Nínive voltara à crueldade e opressão. O livro é um cântico de julgamento: 'O Senhor é tardio em irar-se, mas grande em poder' (1:3). Descreve vividamente o cerco e destruição da cidade 'sanguinária, toda cheia de mentiras e de rapina'. Contrasta com Jonas: agora não há arrependimento, apenas julgamento final. Consola Judá, vítima da Assíria.",
      "funFact": "Nínive caiu de forma dramática: o rio Tigres inundou parte da cidade, abrindo brecha nas muralhas! Arqueologia confirma destruição violenta. Naum significa 'conforto' - sua mensagem era conforto para Judá oprimida. O livro é poesia hebraica de alta qualidade.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "Nínive", "julgamento", "Assíria", "consolo"],
      "imageUrl": "/images/nahum.png",
      "relatedTerms": ["Nínive", "Assíria", "Julgamento"]
    },
    {
      "id": "habacuque_047",
      "word": "HABACUQUE",
      "hint": "Profeta que questionou a Deus sobre o sofrimento dos justos",
      "fullExplanation": "Habacuque dialoga com Deus em dois ciclos de queixa e resposta. Primeiro questiona: por que Deus tolera a violência e injustiça em Judá? Deus responde que enviará os caldeus (babilônios) como instrumento de julgamento. Segundo questionamento: como Deus pode usar nação mais ímpia para punir Judá? Deus responde que o justo viverá pela fé, e que os ímpios serão julgados. O livro termina com oração confiante: 'Ainda que a figueira não floresça... todavia eu me alegrarei no Senhor'.",
      "funFact": "Habacuque 2:4 ('o justo viverá pela fé') tornou-se texto central da Reforma Protestante! Citado por Paulo em Romanos 1:17 e Gálatas 3:11, e Hebreus 10:38. O pergaminho de Habacuque dos Manuscritos do Mar Morto é um dos mais bem preservados.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "questionamento", "fé", "justiça", "sofrimento"],
      "imageUrl": "/images/habakkuk.png",
      "relatedTerms": ["O Justo pela Fé", "Questionamento", "Confiança"]
    },
    {
      "id": "sofonias_048",
      "word": "SOFONIAS",
      "hint": "Profeta do 'Dia do Senhor' como julgamento universal",
      "fullExplanation": "Sofonias, bisneto do rei Ezequias, profetizou durante o reinado de Josias. Anuncia o 'Dia do Senhor' como dia de ira, angústia, trevas e escuridão sobre Judá e todas as nações por idolatria, violência, fraude e apostasia. Chama ao arrependimento: 'Buscai ao Senhor vós todos os mansos da terra... buscai a justiça, buscai a mansidão'. Promete restauração para um remanescente humilde e que se refugia no Senhor. Visão final: Deus restaurará Jerusalém, removendo o juízo e regozijando-se com seu povo.",
      "funFact": "Sofonias contém uma das mais vívidas descrições do Dia do Senhor! 'Aquele dia é dia de ira, dia de tribulação e de angústia, dia de alvoroço e de assolação, dia de trevas e de escuridão' (1:15). O Dies Irae medieval (hino de missa de réquiem) usou esta linguagem.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "Dia do Senhor", "julgamento", "arrependimento", "remanescente"],
      "imageUrl": "/images/zephaniah.png",
      "relatedTerms": ["Dia do Senhor", "Remanescente", "Arrependimento"]
    },
    {
      "id": "ageu_049",
      "word": "AGEU",
      "hint": "Profeta que incentivou a reconstrução do Templo após o exílio",
      "fullExplanation": "Ageu profetizou em 520 a.C. aos judeus retornados do exílio babilônico. O povo havia começado a reconstruir o Templo sob Zorobabel, mas parou por oposição e desânimo, concentrando-se em suas casas. Ageu exorta: 'Considerai os vossos caminhos!'. Argumenta que a seca e pobreza são resultado de negligenciarem a casa de Deus. Incentiva Zorobabel e Josué (sumo sacerdote) a retomarem a obra com coragem. Promete que a glória do segundo Templo será maior que a do primeiro, e antevê futura agitação das nações e estabelecimento do Reino.",
      "funFact": "As profecias de Ageu estão precisamente datadas! Quatro mensagens entre agosto e dezembro de 520 a.C. O segundo Templo (Templo de Zorobabel) foi completado em 515 a.C., 70 anos após a destruição do primeiro (cumprindo Jeremias 25:11). Herodes o ampliou dramaticamente mais tarde.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "Templo", "reconstrução", "Zorobabel", "encorajamento"],
      "imageUrl": "/images/haggai.png",
      "relatedTerms": ["Templo", "Zorobabel", "Reconstrução"]
    },
    {
      "id": "zacarias_050",
      "word": "ZACARIAS",
      "hint": "Profeta de visões apocalípticas e messiânicas pós-exílio",
      "fullExplanation": "Zacarias, contemporâneo de Ageu, incentivou a reconstrução do Templo com visões simbólicas (homem entre murtas, quatro chifres, homem com cordel de medir, Josué vestido de trajes sujos, candelabro de ouro, rolo voador, éfá, quatro carros). Contém profecias messiânicas importantes: 'Eis que te vem o teu Rei, humilde, montado sobre um jumento' (9:9, cumprido na entrada triunfal), 'traspassaram-me' (12:10), 'ferirei o pastor, e as ovelhas se dispersarão' (13:7). Fala de Jerusalém futura, julgamento das nações, e reinado universal de Deus.",
      "funFact": "Zacarias é o mais apocalíptico dos profetas menores! Suas visões influenciaram o Apocalipse de João. A entrada de Jesus em Jerusalém montado em jumento cumpriu Zacarias 9:9. Zacarias 14 prevê o 'Dia do Senhor' quando os pés do Senhor estarão sobre o Monte das Oliveiras.",
      "difficulty": "advanced",
      "category": "Antigo Testamento",
      "tags": ["profeta", "visões", "Messias", "apocalíptico", "Jerusalém"],
      "imageUrl": "/images/zechariah.png",
      "relatedTerms": ["Visões", "Messias", "Apocalíptico"]
    },
    {
      "id": "malaquias_051",
      "word": "MALAQUIAS",
      "hint": "Último profeta do Antigo Testamento, fala de dízimos e precursor",
      "fullExplanation": "Malaquias ('meu mensageiro') profetizou após o retorno do exílio, quando o culto no Templo reconstruído tornara-se negligente. Denuncia sacerdotes que oferecem animais defeituosos, povo que rouba a Deus nos dízimos e ofertas, divórcio fácil e casamento misto. Exorta à fidelidade: 'Trazei todos os dízimos à casa do Tesouro... e provai-me nisto'. Anuncia o 'Dia do Senhor' que queimará como fornalha. Promete o envio de Elias antes desse grande dia - cumprido em João Batista, precursor de Jesus. Últimas palavras do AT apontam para o NT.",
      "funFact": "Malaquias termina o AT com ameaça de maldição e promessa de Elias! O período entre Malaquias e Mateus (c. 400 anos) é chamado 'período intertestamentário'. João Batista veio 'no espírito e poder de Elias' (Lucas 1:17). A frase 'roubando a Deus' em dízimos é única aqui.",
      "difficulty": "medium",
      "category": "Antigo Testamento",
      "tags": ["profeta", "dízimos", "Elias", "João Batista", "Dia do Senhor"],
      "imageUrl": "/images/malachi.png",
      "relatedTerms": ["Dízimos", "Elias", "João Batista"]
    },
    {
      "id": "mateus_052",
      "word": "EVANGELHO DE MATEUS",
      "hint": "Evangelho que apresenta Jesus como Messias rei, cumpridor da Lei",
      "fullExplanation": "Mateus, coletor de impostos convertido, escreveu principalmente para judeus, apresentando Jesus como o Messias prometido, 'Filho de Davi', cumpridor das profecias. Estrutura com cinco discursos principais (Sermão do Monte, missão, parábolas, comunidade, escatologia), intercalados com narrativas. Inclui genealogia que liga Jesus a Abraão e Davi, ênfase no Reino dos Céus (evita 'Reino de Deus' por respeito judaico), citações de cumprimento ('para que se cumprisse'). Único com relato dos magos, fuga para Egito, e Grande Comissão final.",
      "funFact": "Mateus organiza ensinos em blocos de cinco, possivelmente imitando o Pentateuco (cinco livros da Lei)! O evangelho contém cerca de 130 citações ou alusões ao AT. A frase 'Reino dos Céus' aparece 32 vezes (só em Mateus). Foi o evangelho mais citado pelos primeiros pais da igreja.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["evangelho", "Mateus", "Messias", "Reino", "cumprimento"],
      "imageUrl": "/images/matthew.png",
      "relatedTerms": ["Evangelho", "Messias", "Reino dos Céus"]
    },
    {
      "id": "marcos_053",
      "word": "EVANGELHO DE MARCOS",
      "hint": "Evangelho mais curto e dinâmico, focado em ações de Jesus",
      "fullExplanation": "Marcos, provavelmente João Marcos companheiro de Pedro, escreveu o evangelho mais breve e vigoroso, com ênfase nas ações de Jesus como Servo sofredor e poderoso. Caracterizado pelo uso frequente de 'e logo', 'imediatamente', criando senso de urgência. Inicia com ministério público de Jesus, sem narrativa de nascimento. Inclui o 'segredo messiânico' (Jesus manda não divulgar milagres). Termina abruptamente no capítulo 16 (versos 9-20 são adição posterior). Focado em gentios, explica costumes judaicos. Mostra Jesus emocionalmente humano.",
      "funFact": "Marcos é considerado o primeiro evangelho escrito (c. 65-70 d.C.)! Papias (século II) disse que Marcos registrou as memórias de Pedro. O estilo é vivo e pictórico, como a cena do jovem que fugiu nu durante a prisão de Jesus (14:51-52) - possivelmente o próprio Marcos!",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["evangelho", "Marcos", "ação", "servo", "urgência"],
      "imageUrl": "/images/mark.png",
      "relatedTerms": ["Evangelho", "Pedro", "Ação"]
    },
    {
      "id": "lucas_054",
      "word": "EVANGELHO DE LUCAS",
      "hint": "Evangelho histórico e universal, com ênfase em misericórdia e Espírito",
      "fullExplanation": "Lucas, médico gentio companheiro de Paulo, escreveu um evangelho meticuloso e literário como primeiro volume de sua obra (Atos é o segundo). Endereçado a 'Teófilo', apresenta Jesus como Salvador universal, com atenção especial a mulheres, pobres, marginalizados e gentios. Único com narrativas da infância (anúncio a Maria, nascimento com pastores, Jesus no Templo aos 12), muitas parábolas exclusivas (Bom Samaritano, Filho Pródigo), ênfase no Espírito Santo e na oração. Mostra Jesus como 'Filho do Homem' compassivo.",
      "funFact": "Lucas é o evangelho mais longo! Contém 24 capítulos, 1151 versículos. Lucas inclui 18 parábolas não encontradas nos outros evangelhos. Como gentio, traça genealogia de Jesus até Adão (não apenas Abraão), enfatizando universalidade. Seu prólogo é clássico grego cuidadoso.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["evangelho", "Lucas", "universal", "misericórdia", "Espírito Santo"],
      "imageUrl": "/images/luke.png",
      "relatedTerms": ["Evangelho", "Misericórdia", "Parábolas"]
    },
    {
      "id": "joao_055",
      "word": "EVANGELHO DE JOÃO",
      "hint": "Evangelho teológico com sete 'Eu Sou' e prólogo sobre o Verbo",
      "fullExplanation": "João, o 'discípulo amado', escreveu o evangelho mais teológico e reflexivo, organizado em torno de sete sinais (milagres) e sete declarações 'Eu Sou' (pão da vida, luz do mundo, porta, bom pastor, ressurreição e vida, caminho verdade e vida, videira verdadeira). Começa com prólogo metafísico: 'No princípio era o Verbo... e o Verbo se fez carne'. Enfatiza a divindade de Jesus como Filho de Deus, a vida eterna pela fé, e o amor como mandamento novo. Contém discursos profundos (Nicodemos, samaritana) e oração sacerdotal (cap. 17).",
      "funFact": "João escreveu cerca de 60 anos após os eventos! Seu evangelho complementa os sinóticos (Mateus, Marcos, Lucas) com 90% de material único. O propósito é claro: 'para que creiais que Jesus é o Cristo, o Filho de Deus, e para que, crendo, tenhais vida em seu nome' (20:31).",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["evangelho", "João", "teologia", "Eu Sou", "Verbo"],
      "imageUrl": "/images/john.png",
      "relatedTerms": ["Eu Sou", "Verbo", "Sinais"]
    },
    {
      "id": "atos_056",
      "word": "ATOS DOS APÓSTOLOS",
      "hint": "História da igreja primitiva do Pentecostes à prisão de Paulo",
      "fullExplanation": "Atos, segundo volume de Lucas, narra a história da igreja cristã desde a ascensão de Jesus (c. 30 d.C.) até a prisão domiciliar de Paulo em Roma (c. 62 d.C.). Dividido entre ministério de Pedro (cap. 1-12) e de Paulo (cap. 13-28). Registra Pentecostes, crescimento em Jerusalém, perseguição, conversão de Saulo, expansão a Samaria, conversão de Cornélio (primeiro gentil), Concílio de Jerusalém, três viagens missionárias de Paulo, e sua prisão e viagem a Roma. Mostra o Espírito Santo guiando a expansão do evangelho 'até os confins da terra'.",
      "funFact": "Atos é o único relato histórico da igreja do primeiro século! Contém discursos importantes (Pedro no Pentecostes, Estêvão perante o Sinédrio, Paulo no Areópago). Lucas era companheiro de viagem de Paulo ('nós' em certas passagens). O livro termina abruptamente - possivelmente Lucas planejava um terceiro volume.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["história", "igreja", "Espírito Santo", "missões", "Paulo"],
      "imageUrl": "/images/acts.png",
      "relatedTerms": ["Igreja Primitiva", "Espírito Santo", "Missões"]
    },
    {
      "id": "romanos_057",
      "word": "CARTA AOS ROMANOS",
      "hint": "Exposição sistemática da justificação pela fé e vida no Espírito",
      "fullExplanation": "Romanos, escrita por Paulo antes de visitar Roma, é sua obra teológica mais sistemática e influente. Apresenta o evangelho como poder de Deus para salvação de todo aquele que crê, judeu ou grego. Desenvolve: pecado universal (todos sob condenação), justificação pela fé independente das obras da Lei (Abraão como exemplo), resultados (paz com Deus, nova vida), papel da Lei, eleição (cap. 9-11), vida ética no Espírito (sacrifício vivo), responsabilidade para com autoridades e irmãos fracos. Termina com saudações pessoais e doxologia.",
      "funFact": "Romanos revolucionou a vida de Agostinho, Lutero e Wesley! Lutero disse: 'Romanos é a parte principal do NT e o mais puro evangelho'. A frase 'o justo viverá pela fé' (1:17) desencadeou a Reforma. Capítulo 8 é considerado o ápice: 'nenhuma condenação há...'.",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "justificação", "fé", "graça"],
      "imageUrl": "/images/romans.png",
      "relatedTerms": ["Justificação", "Fé", "Graça"]
    },
    {
      "id": "1corintios_058",
      "word": "PRIMEIRA CORÍNTIOS",
      "hint": "Carta que trata divisões, imoralidade, culto e ressurreição",
      "fullExplanation": "1 Coríntios é resposta de Paulo a problemas relatados na igreja cosmopolita e problemática de Corinto. Aborda: divisões partidárias ('eu sou de Paulo, eu de Apolo'), imoralidade tolerada (caso de incesto), litígios em tribunais pagãos, questões sobre casamento, alimentos sacrificados a ídolos, comportamento no culto (mulheres, ceia do Senhor), dons espirituais (cap. 12-14 com hino ao amor no cap. 13), e ressurreição (cap. 15, defesa crucial). Prática, pastoral, com aplicação de princípios do evangelho à vida comunitária.",
      "funFact": "1 Coríntios 13 é um dos textos mais belos da literatura mundial sobre o amor! Frequentemente lido em casamentos. O capítulo 15 contém o mais antigo credo cristão sobre a ressurreição (15:3-8), datado de poucos anos após os eventos. Paulo trabalhou em Corinto fazendo tendas (Atos 18).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "igreja", "problemas", "amor"],
      "imageUrl": "/images/1corinthians.png",
      "relatedTerms": ["Amor (Ágape)", "Dons Espirituais", "Ressurreição"]
    },
    {
      "id": "galatas_059",
      "word": "CARTA AOS GÁLATAS",
      "hint": "Defesa apaixonada do evangelho da graça contra judaizantes",
      "fullExplanation": "Gálatas é carta vigorosa de Paulo contra 'judaizantes' que insistiam que gentios convertidos deviam ser circuncidados e guardar a Lei mosaica para serem salvos. Paulo defende que a justificação é somente pela fé em Cristo, não pelas obras da Lei. Relata seu confronto com Pedro em Antioquia sobre hipocrisia. Usa argumentos bíblicos (Abraão creu e foi justificado), experienciais (recepção do Espírito pela fé), e lógicos (a Lei mostra pecado, não salva). Exorta à liberdade cristã, não como licença, mas para servir em amor.",
      "funFact": "Gálatas é a 'Declaração de Independência' da graça cristã! Lutero a chamou de 'minha carta, eu me casei com ela'. Contém 'frutas do Espírito' (5:22-23). Paulo escreveu de próprio punho parte dela (6:11). Os gálatas eram celtas na região da Turquia central.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "graça", "liberdade", "fé"],
      "imageUrl": "/images/galatians.png",
      "relatedTerms": ["Graça", "Fé", "Liberdade Cristã"]
    },
    {
      "id": "efesios_060",
      "word": "CARTA AOS EFÉSIOS",
      "hint": "Carta sobre a igreja como corpo de Cristo e armadura espiritual",
      "fullExplanation": "Efésios, uma das 'cartas da prisão', desenvolve o tema do propósito eterno de Deus em Cristo: unir todas as coisas, nos céus e na terra. Fala da riqueza da graça, predestinação, reconciliação de judeus e gentios em um novo homem, igreja como corpo de Cristo e templo do Espírito. Exorta à unidade, maturidade, renovação da mente, relacionamentos familiares (esposos, filhos, escravos). Inclui famosa descrição da 'armadura de Deus' (cap. 6) para resistir às ciladas do diabo. Linguagem elevada, focada na cosmovisão cristã.",
      "funFact": "Efésios pode ter sido carta circular para várias igrejas, não apenas Éfeso! Alguns manuscritos antigos não têm 'em Éfeso' (1:1). Contém longas sentenças no grego original (1:3-14 é uma só!). O Templo de Ártemis em Éfeso era uma das sete maravilhas.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "igreja", "armadura", "unidade"],
      "imageUrl": "/images/ephesians.png",
      "relatedTerms": ["Igreja", "Armadura de Deus", "Unidade"]
    },
    {
      "id": "filipenses_061",
      "word": "CARTA AOS FILIPENSES",
      "hint": "Carta da alegria escrita na prisão, com hino cristológico",
      "fullExplanation": "Filipenses é carta afetuosa de Paulo à igreja que o apoiava financeiramente, escrita na prisão (possivelmente Roma). Tema central: alegria em Cristo apesar das circunstâncias ('alegrai-vos sempre'). Inclui hino cristológico (2:5-11) sobre a kenosis (esvaziamento) de Cristo e sua exaltação. Fala de sua própria experiência: 'para mim o viver é Cristo, e o morrer é lucro', 'prossigo para o alvo'. Agradece oferta dos filipenses. Exorta à humildade, unidade e contentamento em toda situação.",
      "funFact": "Filipenses é chamada 'a carta da alegria'! A palavra 'alegria' ou 'regozijar' aparece 16 vezes. O hino de Filipenses 2 é considerado um dos mais antigos credos cristãos, possivelmente pré-paulino. Paulo estava acorrentado a guardas romanos quando escreveu.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "alegria", "Cristo", "contentamento"],
      "imageUrl": "/images/philippians.png",
      "relatedTerms": ["Alegria", "Kenosis", "Contentamento"]
    },
    {
      "id": "colossenses_062",
      "word": "CARTA AOS COLOSSENSES",
      "hint": "Defesa da supremacia de Cristo contra heresias sincréticas",
      "fullExplanation": "Colossenses, escrita da prisão, combate uma heresia sincrética em Colossos que misturava elementos judaicos (observância de dias, alimentos), ascéticos, angelolatria e filosofia grega, diminuindo a suficiência de Cristo. Paulo exalta a supremacia e suficiência de Cristo: imagem do Deus invisível, primogênito de toda criação, nele habita corporalmente a plenitude da divindade, cabeça da igreja. Exorta a viver a realidade da nova vida em Cristo, mortos para práticas antigas. Inclúi instruções para família e escravos.",
      "funFact": "Colossenses tem paralelos notáveis com Efésios! Cristo é apresentado como 'primogênito' não no tempo mas em supremacia. A heresia combatida parece ser uma forma primitiva de gnosticismo. A cidade de Colossos foi destruída por terremoto em 60 d.C., pouco depois desta carta.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "supremacia", "Cristo", "suficiência"],
      "imageUrl": "/images/colossians.png",
      "relatedTerms": ["Supremacia de Cristo", "Plenitude", "Heresia"]
    },
    {
      "id": "1tessalonicenses_063",
      "word": "PRIMEIRA TESSALONICENSES",
      "hint": "Carta sobre a segunda vinda de Cristo e vida santa",
      "fullExplanation": "1 Tessalonicenses é provavelmente a primeira carta de Paulo (c. 51 d.C.), escrita para a jovem igreja fundada durante sua segunda viagem missionária. Elogia sua fé exemplar apesar de perseguição. Responde a preocupações sobre irmãos que morreram antes da volta de Cristo: os que 'dormem' ressuscitarão primeiro, então os vivos serão arrebatados juntamente com eles nas nuvens. Exorta à santidade, trabalho diligente, amor fraternal, e preparo para a vinda do Senhor 'como ladrão de noite'. Termina com instruções práticas.",
      "funFact": "1 Tessalonicenses contém uma das primeiras descrições do arrebatamento! (4:13-18). Tessalônica (atual Salônica) era capital da Macedônia, importante porto. Paulo trabalhou lá como curtidor de couro (Atos 18:3). A carta reflete ternura pastoral: 'como mãe que acaricia seus filhos' (2:7).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "segunda vinda", "arrebatamento", "santidade"],
      "imageUrl": "/images/1thessalonians.png",
      "relatedTerms": ["Segunda Vinda", "Arrebatamento", "Santidade"]
    },
    {
      "id": "1timoteo_064",
      "word": "PRIMEIRA TIMÓTEO",
      "hint": "Instruções pastorais sobre liderança da igreja e doutrina sã",
      "fullExplanation": "1 Timóteo é uma das 'cartas pastorais', escrita a Timóteo, jovem pastor em Éfeso. Oferece instruções sobre organização da igreja, qualificações de bispos (epíscopos) e diáconos, cuidado com falsos mestres, liturgia, tratamento de viúvas, relações com presbíteros. Enfatiza 'doutrina sã', combate a especulações vãs e ganância. Inclui famosa declaração: 'Cristo Jesus veio ao mundo para salvar os pecadores, dos quais eu sou o principal' (1:15). Adverte sobre amor ao dinheiro e exorta a combater 'o bom combate da fé'.",
      "funFact": "Timóteo era filho de mãe judia e pai grego, circuncidado por Paulo para ministrar a judeus (Atos 16:3). Era tímido e propenso a enfermidades (1 Timóteo 5:23). As qualificações para líderes em 3:1-13 são usadas até hoje por muitas igrejas.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "pastoral", "liderança", "doutrina"],
      "imageUrl": "/images/1timothy.png",
      "relatedTerms": ["Liderança", "Doutrina", "Timóteo"]
    },
    {
      "id": "tito_065",
      "word": "CARTA A TITO",
      "hint": "Instruções para organizar igrejas em Creta",
      "fullExplanation": "Tito é carta pastoral a Tito, gentio convertido e colaborador de Paulo, deixado em Creta para organizar as igrejas. Instrui sobre qualificações de presbíteros, como lidar com falsos mestres (especialmente 'os da circuncisão'), e exortações a diferentes grupos (idosos, jovens, escravos). Enfatiza que a graça de Deus 'nos ensina a renunciar à impiedade' e viver vida sã. Adverte sobre cretenses (citando poeta local: 'sempre mentirosos, feras ruins, ventres preguiçosos'). Exorta a boa cidadania e preparação para a 'bem-aventurada esperança'.",
      "funFact": "Tito era gentio não circuncidado, tornando-se caso-teste no Concílio de Jerusalém (Gálatas 2)! Paulo o chamou de 'verdadeiro filho na fé comum'. Creta era ilha com reputação de imoralidade. A frase 'em tudo sejam padrão de boas obras' (2:7) resume a mensagem.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "pastoral", "Creta", "graça"],
      "imageUrl": "/images/titus.png",
      "relatedTerms": ["Tito", "Creta", "Graça"]
    },
    {
      "id": "filemon_066",
      "word": "CARTA A FILEMOM",
      "hint": "Apelo pessoal para receber de volta um escravo fugitivo convertido",
      "fullExplanation": "Filemom é carta pessoal de Paulo a Filemom, cristão abastado de Colossos, cujo escravo Onésimo fugira, roubara, e encontrara Paulo na prisão, convertendo-se. Paulo envia Onésimo de volta com esta carta, apelando que Filemom o receba não mais como escravo, mas como irmão amado. Oferece pagar qualquer dívida, mas lembra que Filemom lhe deve sua própria vida (conversão por Paulo). Demonstra transformação do evangelho em relações sociais: Onésimo ('útil') antes inútil, agora útil tanto a Paulo quanto a Filemom.",
      "funFact": "Filemom é a única carta puramente pessoal de Paulo no NT! Onésimo significa 'útil' - Paulo faz trocadilho: 'antes inútil, agora útil'. A carta influenciou o movimento abolicionista. Tradição diz que Onésimo tornou-se bispo de Éfeso e coletou as cartas de Paulo.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["epístola", "Paulo", "escravidão", "perdão", "Onésimo"],
      "imageUrl": "/images/philemon.png",
      "relatedTerms": ["Onésimo", "Escravidão", "Perdão"]
    },
    {
      "id": "hebreus_067",
      "word": "CARTA AOS HEBREUS",
      "hint": "Exposição sobre a superioridade de Cristo sobre o Antigo Pacto",
      "fullExplanation": "Hebreus, de autor desconhecido (não Paulo), é sermão exortativo a cristãos judeus tentados a voltar ao judaísmo diante da perseguição. Argumenta a superioridade de Cristo sobre profetas, anjos, Moisés, sacerdócio levítico, e sacrifícios antigos. Apresenta Jesus como Sumo Sacerdote eterno segundo a ordem de Melquisedeque, mediador de nova e melhor aliança, com sacrifício único e perfeito. Inclui galeria da fé (cap. 11) com exemplos de perseverança. Adverte seriamente contra apostasia. Exorta a correr com perseverança a carreira.",
      "funFact": "Hebreus contém os mais fortes avisos contra apostasia no NT! O estilo literário é o mais polido do NT. Melquisedeque ('rei de justiça, rei de paz') aparece em Gênesis 14 e Salmo 110. A frase 'Jesus Cristo é o mesmo ontem, hoje e eternamente' (13:8) é famosa.",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["epístola", "Cristo", "sacerdócio", "aliança", "fé"],
      "imageUrl": "/images/hebrews.png",
      "relatedTerms": ["Sacerdócio", "Melquisedeque", "Fé"]
    },
    {
      "id": "tiago_068",
      "word": "CARTA DE TIAGO",
      "hint": "Carta prática sobre fé que se mostra por obras",
      "fullExplanation": "Tiago (provavelmente irmão de Jesus, líder da igreja de Jerusalém) escreve uma carta prática, parecida com literatura de sabedoria, focada em ética cristã. Enfatiza que fé genuína produz obras: 'a fé sem obras é morta'. Adverte sobre perigos da língua, parcialidade para com ricos, confiança em riquezas, julgamento precipitado. Exorta à paciência no sofrimento, oração eficaz, cuidado com mundanismo. Começa: 'Meus irmãos, tende por motivo de grande gozo o passardes por várias provações'. Escrita com autoridade direta.",
      "funFact": "Tiago desafiou Lutero, que a chamou de 'epístola de palha' por enfatizar obras! Lutero posteriormente a valorizou. Tiago cita o Sermão do Monte frequentemente. O autor era conhecido como 'Tiago, o Justo' por sua piedade, martirizado em 62 d.C.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Tiago", "obras", "fé", "prática"],
      "imageUrl": "/images/james.png",
      "relatedTerms": ["Fé e Obras", "Sabedoria", "Prática"]
    },
    {
      "id": "1pedro_069",
      "word": "PRIMEIRA PEDRO",
      "hint": "Carta sobre sofrimento como cristão e esperança viva",
      "fullExplanation": "1 Pedro é carta de encorajamento a cristãos (principalmente gentios) enfrentando perseguição no Império Romano (possivelmente sob Nero). Pedro, apóstolo, escreve sobre 'esperança viva' pela ressurreição, identidade como 'povo adquirido, sacerdócio real, nação santa'. Exorta a viver vida santa entre pagãos, submeter-se a autoridades, escravos a senhos, esposos uns aos outros. Encoraja a sofrer como cristão, não como criminoso, seguindo o exemplo de Cristo que 'sofreu por vós, deixando-vos exemplo'. Termina com admoestações a presbíteros.",
      "funFact": "Pedro usa muitas imagens do AT aplicadas à igreja! Escreve da 'Babilônia' (Roma) (5:13). Marcos está com ele ('meu filho'). A frase 'estais guardados na virtude de Deus pela fé' (1:5) é comforto. Pedro foi martirizado em Roma por volta de 64-67 d.C.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "Pedro", "sofrimento", "esperança", "santidade"],
      "imageUrl": "/images/1peter.png",
      "relatedTerms": ["Sofrimento", "Esperança", "Santidade"]
    },
    {
      "id": "2pedro_070",
      "word": "SEGUNDA PEDRO",
      "hint": "Advertência contra falsos mestres e defesa da segunda vinda",
      "fullExplanation": "2 Pedro é carta de advertência sobre falsos mestres que negam o senhorio de Cristo, vivem libertinamente, e zombam da segunda vinda ('onde está a promessa da sua vinda?'). Pedro defende a veracidade da transfiguração como testemunha ocular, e as profecias como 'luz que brilha em lugar escuro'. Adverte sobre consequências terríveis para apóstatas, usando exemplos de anjos caídos, Dilúvio, Sodoma. Exorta a crescer na graça e conhecimento. Refere-se às cartas de Paulo como 'Escrituras'. Últimas palavras conhecidas de Pedro antes do martírio.",
      "funFact": "2 Pedro é a carta mais controversa quanto à autoria! Estilo diferente de 1 Pedro. Contém única referência neotestamentária a Paulo como escritor de 'Escrituras'. A descrição da transfiguração (1:16-18) é testemunha ocular. Pedro antevê sua morte iminente (1:14).",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["epístola", "Pedro", "falsos mestres", "segunda vinda", "transfiguração"],
      "imageUrl": "/images/2peter.png",
      "relatedTerms": ["Falsos Mestres", "Transfiguração", "Paulo"]
    },
    {
      "id": "1joao_071",
      "word": "PRIMEIRA JOÃO",
      "hint": "Carta sobre amor, luz e vida, contra falsos ensinos gnósticos",
      "fullExplanation": "1 João é escrita pastoral contra proto-gnósticos que negavam a encarnação real de Jesus (docetismo) e separavam espiritualidade da ética. Desenvolve temas de luz vs. trevas, amor vs. ódio, verdade vs. mentira, vida vs. morte. Testes para conhecer se estamos na verdade: crer que Jesus é o Cristo, guardar seus mandamentos, amar os irmãos. Famosa definição: 'Deus é amor'. Adverte sobre 'anticristos'. Garante perdão aos que confessam. Escrita com autoridade apostólica, provavelmente por João o evangelista em idade avançada.",
      "funFact": "1 João não tem saudação ou despedida típica de carta! Parece sermão circular. Contém o versículo mais citado sobre a Trindade: 'Há três que testificam no céu: o Pai, a Palavra e o Espírito Santo' (5:7-8 na Vulgata, não nos melhores manuscritos gregos).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["epístola", "João", "amor", "luz", "verdade"],
      "imageUrl": "/images/1john.png",
      "relatedTerms": ["Amor", "Luz", "Verdade"]
    },
    {
      "id": "apocalipse_fim_072",
      "word": "NOVA JERUSALÉM",
      "hint": "Cidade celestial descrita no final do Apocalipse",
      "fullExplanation": "A Nova Jerusalém é a cidade santa que desce do céu, de Deus, no final da visão de João (Apocalipse 21-22). Descrição simbólica: tem a glória de Deus, brilho como pedra preciosíssima, doze portas com nomes das tribos, doze fundamentos com nomes dos apóstolos, medidas gigantescas (cubo perfeito de 2.200km de lado), construída de ouro puro como vidro transparente, ruas de ouro puro, rio da água da vida, árvore da vida dando doze frutos, trono de Deus e do Cordeiro nela, sem templo pois Deus é seu templo, sem sol/lua pois a glória de Deus a ilumina, sem morte nem dor.",
      "funFact": "A Nova Jerusalém é apresentada como noiva adornada para seu marido! O cubo perfeito lembra o Santo dos Santos do Templo. Suas dimensões são astronômicas - se fosse na Terra, se estenderia além da atmosfera! A descrição combina imagens do Éden restaurado e da cidade ideal.",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["cidade", "céu", "eternidade", "visão", "restauração"],
      "imageUrl": "/images/new-jerusalem.png",
      "relatedTerms": ["Apocalipse", "Céu", "Restauração"]
    },
    {
      "id": "genealogia_073",
      "word": "GENEALOGIA DE JESUS",
      "hint": "Linha ancestral de Jesus apresentada em Mateus e Lucas",
      "fullExplanation": "O NT apresenta duas genealogias de Jesus: Mateus 1:1-17 (para judeus, traça de Abraão a José, com três grupos de 14 gerações, inclui mulheres incomuns: Tamar, Raabe, Rute, Bate-Seba) e Lucas 3:23-38 (para gentios, traça de Jesus até Adão, possivelmente através de Maria). Mateus enfatiza Jesus como Filho de Davi (rei) e Filho de Abraão (judeu); Lucas como Filho do Homem (universal). Diferenças explicadas por diferentes linhagens (José vs. Maria) ou por uso de 'filho' em sentido amplo. Confirmam cumprimento de promessas messiânicas.",
      "funFact": "Mateus organiza em 3x14 gerações! 14 é valor numérico do nome 'Davi' em hebraico (DVD = 4+6+4=14). Inclui quatro mulheres gentias, mostrando inclusão. Lucas tem 77 nomes de Jesus até Adão. Ambas mostram que Jesus legalmente (Mateus) e biologicamente (Lucas) descende de Davi.",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["genealogia", "Jesus", "Mateus", "Lucas", "Davi"],
      "imageUrl": "/images/genealogy.png",
      "relatedTerms": ["Jesus", "Davi", "Abraão"]
    },
    {
      "id": "beatitudes_074",
      "word": "BEM-AVENTURANÇAS",
      "hint": "Oito declarações de Jesus no Sermão do Monte começando com 'Bem-aventurados'",
      "fullExplanation": "As Bem-aventuranças (Mateus 5:3-12) são o início do Sermão do Monte, descrevendo o caráter dos cidadãos do Reino e suas recompensas. Incluem: pobres de espírito (Reino), os que choram (consolo), mansos (herdar a terra), famintos de justiça (saciados), misericordiosos (misericórdia), limpos de coração (ver a Deus), pacificadores (filhos de Deus), perseguidos por justiça (Reino). Paradoxalmente, elogia atributos considerados fracos pelo mundo. Revelam valores invertidos do Reino. Lucas tem versão mais curta (6:20-26) com 'ais' correspondentes.",
      "funFact": "As Bem-aventuranças são radicalmente contraculturais! 'Pobres de espírito' não significa materialmente pobres, mas humildes espiritualmente. A nona bem-aventurança (versículo 11-12) aplica especificamente aos discípulos perseguidos. Formam o 'manifesto' do Reino de Deus.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["Jesus", "sermão", "bem-aventuranças", "reino", "caráter"],
      "imageUrl": "/images/beatitudes.png",
      "relatedTerms": ["Sermão do Monte", "Reino de Deus", "Caráter"]
    },
    {
      "id": "pai_nosso_075",
      "word": "PAI NOSSO",
      "hint": "Oração modelo ensinada por Jesus aos discípulos",
      "fullExplanation": "O Pai Nosso (Mateus 6:9-13; Lucas 11:2-4) é a oração que Jesus ensinou quando os discípulos pediram: 'Senhor, ensina-nos a orar'. Versão de Mateus tem sete petições: três relacionadas a Deus (santificado seja teu nome, venha teu reino, seja feita tua vontade) e quatro a necessidades humanas (pão quotidiano, perdão de dívidas, não cair em tentação, livrar do mal). Lucas tem versão mais curta. Não é mantra para repetição mecânica, mas modelo de conteúdo e prioridades: primeiro Deus e seu Reino, depois necessidades humanas.",
      "funFact": "O Pai Nosso é a oração mais conhecida e recitada no cristianismo! A versão litúrgica acrescenta 'porque teu é o reino, o poder e a glória para sempre' (doxologia) que não está nos melhores manuscritos de Mateus, mas reflete 1 Crônicas 29:11. Usada em cultos desde o século II.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["oração", "Jesus", "modelo", "discípulos", "Mateus"],
      "imageUrl": "/images/lords-prayer.png",
      "relatedTerms": ["Oração", "Jesus", "Discípulos"]
    },
    {
      "id": "bom_samaritano_076",
      "word": "BOM SAMARITANO",
      "hint": "Parábola sobre ajudar pessoas necessitadas independente de origem",
      "fullExplanation": "A parábola do Bom Samaritano (Lucas 10:25-37) foi contada por Jesus em resposta a pergunta: 'Quem é o meu próximo?'. Um homem viajando de Jerusalém a Jericó é assaltado, ferido e deixado semimorto. Um sacerdote e um levita passam pelo outro lado. Um samaritano (grupo desprezado pelos judeus) vê, tem compaixão, trata feridas, leva a estalagem, paga cuidados. Jesus pergunta: 'Qual destes três te parece ter sido o próximo do homem?'. Resposta: 'Aquele que usou de misericórdia'. Jesus conclui: 'Vai e faze o mesmo'.",
      "funFact": "A estrada de Jerusalém a Jericó era conhecida como 'Caminho de Sangue' por sua perigosidade! Samaritanos e judeus se odiavam por diferenças étnicas e religiosas. A parábola redefine 'próximo' como qualquer pessoa necessitada, não apenas conterrâneos. Revolucionou a ética do amor.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["parábola", "Jesus", "samaritano", "amor", "próximo"],
      "imageUrl": "/images/good-samaritan.png",
      "relatedTerms": ["Parábola", "Samaritano", "Amor ao Próximo"]
    },
    {
      "id": "filho_prodigo_077",
      "word": "FILHO PRÓDIGO",
      "hint": "Parábola sobre pai amoroso que recebe filho arrependido",
      "fullExplanation": "A parábola do Filho Pródigo (Lucas 15:11-32) é uma das três sobre coisas perdidas (ovelha, dracma, filho). Um filho mais novo pede herança antecipada, vai a país distante, esbanja em vida dissoluta. Após fome, emprega-se cuidando de porcos (trabalho impuro para judeus), desejando comer suas bolotas. Cai em si, decide voltar como servo. O pai o vê ao longe, corre, abraça, veste melhor roupa, mata novilho gordo, celebra. O filho mais velho se ressente; pai explica: 'era preciso festejarmos, porque este teu irmão estava morto e reviveu'.",
      "funFact": "O pai correndo era comportamento indigno para patriarca oriental! Mostra amor ativo. A parábola é também sobre o filho mais velho (fariseus) que pensa ter cumprido dever, mas não compartilha alegria do pai. O termo 'pródigo' significa esbanjador. Ilustra graça incondicional.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["parábola", "Jesus", "perdão", "pai", "graça"],
      "imageUrl": "/images/prodigal-son.png",
      "relatedTerms": ["Parábola", "Perdão", "Graça"]
    },
    {
      "id": "semeador_078",
      "word": "PARÁBOLA DO SEMEADOR",
      "hint": "História sobre diferentes respostas à palavra de Deus",
      "fullExplanation": "A parábola do Semeador (Mateus 13:1-23, Marcos 4:1-20, Lucas 8:4-15) fala de um semeador que lança semente em quatro tipos de solo: à beira do caminho (aves comem), em solo rochoso (cresce rápido mas seca por falta de raiz), entre espinhos (sufocada), e em boa terra (produz fruto, cem, sessenta ou trinta por um). Jesus explica aos discípulos que a semente é a palavra do Reino, os solos são diferentes tipos de corações. Única parábola com explicação detalhada, destacando obstáculos à frutificação: Satanás, tribulação, riquezas/ preocupações.",
      "funFact": "Esta é a primeira parábola em Mateus e Marcos! Jesus diz que aos discípulos é dado conhecer mistérios do Reino, mas aos de fora em parábolas. A produtividade na agricultura palestina média era 7-8 por um; 30-60-100 é extraordinária! Aplica-se a evangelismo e crescimento espiritual.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["parábola", "Jesus", "semente", "coração", "fruto"],
      "imageUrl": "/images/sower.png",
      "relatedTerms": ["Parábola", "Semente", "Coração"]
    },
    {
      "id": "joao_batista_079",
      "word": "JOÃO BATISTA",
      "hint": "Pregador no deserto que preparou o caminho para Jesus",
      "fullExplanation": "João Batista, filho de Zacarias e Isabel (parente de Maria), foi profeta ascético que pregou no deserto da Judeia, vestindo pêlos de camelo e cinto de couro, alimentando-se de gafanhotos e mel silvestre. Sua mensagem: 'Arrependei-vos, porque está próximo o reino dos céus'. Batizava no Jordão como símbolo de arrependimento. Identificou Jesus como 'Cordeiro de Deus que tira o pecado do mundo' e o batizou. Criticou Herodes Antipas por adultério, sendo preso e decapitado a pedido de Salomé. Jesus o chamou de maior nascido de mulher, mas menor no Reino.",
      "funFact": "João era seis meses mais velho que Jesus! Seu nascimento milagroso a pais idosos foi anunciado por anjo. Vivia como nazireu. Jesus disse que ele era o 'Elias que havia de vir' (Mateus 11:14). Seus discípulos formaram movimento distinto (Atos 19:1-7).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["profeta", "batismo", "arrependimento", "precursor", "deserto"],
      "imageUrl": "/images/john-baptist.png",
      "relatedTerms": ["Batismo", "Precursor", "Arrependimento"]
    },
    {
      "id": "nicodemos_080",
      "word": "NICODEMOS",
      "hint": "Fariseu que visitou Jesus de noite e ouviu sobre novo nascimento",
      "fullExplanation": "Nicodemos era fariseu, membro do Sinédrio, que visitou Jesus à noite (provavelmente para discrição). Reconheceu Jesus como mestre vindo de Deus. Jesus disse: 'Em verdade, em verdade te digo que, se alguém não nascer de novo, não pode ver o reino de Deus'. Nicodemos entende literalmente nascer segunda vez do ventre. Jesus explica nascimento da água e do Espírito. Continua com famoso João 3:16. Nicodemos mais tarde defendeu Jesus no Sinédrio (João 7:50-51) e ajudou no sepultamento com mirra e aloés (João 19:39).",
      "funFact": "Nicodemos significa 'vitória do povo'! Sua visita noturna simboliza vindo das trevas à luz. Tornou-se santo na tradição cristã. A frase 'nascer de novo' tornou-se termo central no evangelicalismo. João 3:16 é o 'evangelho em miniatura', o versículo mais conhecido da Bíblia.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["fariseu", "Jesus", "novo nascimento", "noite", "João 3:16"],
      "imageUrl": "/images/nicodemus.png",
      "relatedTerms": ["Novo Nascimento", "João 3:16", "Fariseu"]
    },
    {
      "id": "samaritana_081",
      "word": "SAMARITANA",
      "hint": "Mulher com quem Jesus conversou no poço sobre água viva",
      "fullExplanation": "Jesus, atravessando Samaria, sentou-se junto ao poço de Jacó em Sicar. Uma mulher samaritana veio tirar água ao meio-dia (hora incomum, sugerindo exclusão social). Jesus pediu água, depois ofereceu 'água viva' que sacia para sempre. Revelou que conhecia seus cinco maridos e que o atual não era seu marido. A mulher reconheceu-o como profeta, discutiu sobre local de adoração (monte Gerizim vs. Jerusalém). Jesus declarou: 'Deus é Espírito, e importa que os que o adoram o adorem em espírito e em verdade'. Ela testemunhou aos aldeões, muitos creram.",
      "funFact": "Esta é a conversa mais longa de Jesus registrada nos evangelhos! Jesus quebrou três barreiras sociais: racial (judeu-samaritano), de gênero (homem-mulher sozinhos) e moral (justo-pecadora). A mulher tornou-se primeira missionária aos samaritanos. O poço de Jacó ainda existe perto de Nablus.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["mulher", "samaritana", "Jesus", "água viva", "adoração"],
      "imageUrl": "/images/samaritan-woman.png",
      "relatedTerms": ["Samaritana", "Água Viva", "Adoração"]
    },
    {
      "id": "zaqueu_082",
      "word": "ZAQUEU",
      "hint": "Coletor de impostos rico que subiu em árvore para ver Jesus",
      "fullExplanation": "Zaqueu era chefe dos publicanos em Jericó, rico mas baixo de estatura. Para ver Jesus passar pela multidão, subiu a um sicômoro. Jesus olhou para cima e disse: 'Zaqueu, desce depressa, pois hoje me convém pousar em tua casa'. A multidão murmurava que Jesus se hospedava com pecador. Zaqueu declarou: 'Senhor, dou aos pobres metade dos meus bens; e, se em alguma coisa tenho defraudado alguém, restituo quadruplicado'. Jesus declarou: 'Hoje veio a salvação a esta casa, porque também este é filho de Abraão'.",
      "funFact": "Sicômoro é uma figueira brava com galhos baixos! Jericó era centro de comércio de bálsamo, tornando publicanos ricos. A restituição quadruplicada excedia a lei (Êxodo 22:1 exigia o dobro para roubo). Zaqueu significa 'puro' ou 'justo' - irônico antes da conversão.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["publicano", "Jericó", "Jesus", "conversão", "restituição"],
      "imageUrl": "/images/zacchaeus.png",
      "relatedTerms": ["Publicano", "Conversão", "Restituição"]
    },
    {
      "id": "pedro_083",
      "word": "PEDRO",
      "hint": "Discípulo impulsivo que se tornou líder da igreja primitiva",
      "fullExplanation": "Simão Pedro, pescador de Betsaida, irmão de André, foi um dos primeiros discípulos. Jesus o chamou de Pedro (rocha) e disse que sobre esta rocha edificaria sua igreja. Impulsivo: andou sobre água mas afundou por dúvida; cortou orelha de Malco; negou Jesus três vezes mas se arrependeu amargamente. Primeiro a pregar no Pentecostes, realizou milagres, abriu evangelho aos gentios (Cornélio). Preso e milagrosamente libertado. Escreveu duas cartas. Tradição diz que foi crucificado de cabeça para baixo em Roma, considerando-se indigno de morrer como Jesus.",
      "funFact": "Pedro é mencionado 191 vezes no NT - mais que qualquer outro discípulo! Seu nome original era Simão bar Jonas. A 'confissão de Cesareia' ('Tu és o Cristo') é ponto de virada nos evangelhos. Suas negações foram preditas por Jesus durante a Última Ceia.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["apóstolo", "Pedro", "líder", "igreja", "negação"],
      "imageUrl": "/images/peter.png",
      "relatedTerms": ["Pedro", "Igreja", "Negação"]
    },
    {
      "id": "joao_apostolo_084",
      "word": "JOÃO",
      "hint": "Discípulo amado que escreveu evangelho, cartas e Apocalipse",
      "fullExplanation": "João, filho de Zebedeu e irmão de Tiago, foi pescador chamado com André e Pedro. Conhecido como 'discípulo amado', reclinou-se ao peito de Jesus na Última Ceia. Esteve ao pé da cruz, onde Jesus confiou sua mãe a ele. Primeiro a crer na ressurreição ao ver o túmulo vazio. Líder da igreja em Jerusalém, depois em Éfeso. Exilado em Patmos, onde escreveu Apocalipse. Tradicionalmente autor do quarto evangelho e três cartas. Único apóstolo que não foi martirizado, morrendo de velhice em Éfeso por volta de 100 d.C.",
      "funFact": "João e Tiago eram chamados 'filhos do trovão' por Jesus! Pediram para sentar à direita e esquerda no Reino. João viveu mais que todos os apóstolos, testemunhando a destruição de Jerusalém (70 d.C.). Diz-se que na velhice repetia: 'Filhinhos, amai-vos uns aos outros'.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["apóstolo", "João", "discípulo amado", "evangelho", "Apocalipse"],
      "imageUrl": "/images/john-apostle.png",
      "relatedTerms": ["João", "Discípulo Amado", "Apocalipse"]
    },
    {
      "id": "tomas_085",
      "word": "TOMÉ",
      "hint": "Discípulo que duvidou da ressurreição até ver Jesus pessoalmente",
      "fullExplanation": "Tomé (Dídimo, 'gêmeo') é conhecido principalmente por seu ceticismo após a ressurreição. Ausente quando Jesus apareceu aos discípulos, disse: 'Se eu não vir o sinal dos cravos nas suas mãos, e não puser o dedo no lugar dos cravos, e não puser a minha mão no seu lado, de modo algum acreditarei'. Oito dias depois, Jesus apareceu, convidou Tomé a tocar suas feridas. Tomé exclamou: 'Senhor meu e Deus meu!'. Jesus disse: 'Porque me viste, creste? Bem-aventurados os que não viram e creram'.",
      "funFact": "Tomé é chamado 'incrédulo' mas também mostrou coragem: quando Jesus decidiu ir a Betânia após a morte de Lázaro, Tomé disse aos discípulos: 'Vamos também nós, para morrermos com ele' (João 11:16). Tradição diz que evangelizou a Índia, onde há cristãos chamados 'cristãos de São Tomé'.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["apóstolo", "Tomé", "dúvida", "crença", "ressurreição"],
      "imageUrl": "/images/thomas.png",
      "relatedTerms": ["Dúvida", "Ressurreição", "Fé"]
    },
    {
      "id": "mateus_apostolo_086",
      "word": "MATEUS",
      "hint": "Coletor de impostos que se tornou discípulo e evangelista",
      "fullExplanation": "Mateus (também chamado Levi) era publicano (coletor de impostos para Roma) em Cafarnaum, considerado traidor e pecador pelos judeus. Jesus o chamou: 'Segue-me'. Mateus levantou-se e o seguiu, dando grande banquete em sua casa onde Jesus comeu com publicanos e pecadores. Os fariseus criticaram; Jesus respondeu: 'Não são os sãos que precisam de médico, mas sim os doentes'. Tradicionalmente autor do primeiro evangelho. Pregou na Judeia, Etiópia, Pérsia. Martírio variadamente descrito: espada, fogo, lança.",
      "funFact": "Mateus significa 'dom de Deus'! Como publicano, conhecia aramaico (língua do povo), hebraico (escrituras) e grego (administração). Seu evangelho cita muito o AT, mostrando conhecimento escriturístico. O chamado de Mateus é um dos poucos relatos do chamado de um discípulo nos sinóticos.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["apóstolo", "Mateus", "publicano", "evangelho", "chamado"],
      "imageUrl": "/images/matthew-apostle.png",
      "relatedTerms": ["Mateus", "Publicano", "Evangelho"]
    },
    {
      "id": "judas_iscariotes_087",
      "word": "JUDAS ISCARIOTES",
      "hint": "Discípulo que traiu Jesus por trinta moedas de prata",
      "fullExplanation": "Judas Iscariotes (possivelmente 'homem de Queriote') foi um dos Doze, encarregado da bolsa (roubava dela). Satanás entrou nele; ele concordou em trair Jesus aos principais sacerdotes por trinta moedas de prata (valor de um escravo). Na Última Ceia, Jesus indicou que seria traído por aquele a quem desse o bocado molhado - deu a Judas, dizendo 'O que fazes, faze-o depressa'. No Getsêmani, traiu Jesus com beijo. Após ver Jesus condenado, arrependeu-se, devolveu o dinheiro, e enforcou-se. Os sacerdotes compraram o Campo do Oleiro com ele, chamado 'Campo de Sangue'.",
      "funFact": "Trinta moedas de prata cumpriam Zacarias 11:12-13! Judas é o único discípulo não galileu (Iscariote = homem de Queriote, cidade na Judeia). Seu nome significa 'louvor' (Judá) - triste contraste com sua ação. Atos 1:18 diz que caiu e rebentou-se, possivelmente complementando a forca.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["apóstolo", "Judas", "traição", "suicídio", "trinta moedas"],
      "imageUrl": "/images/judas.png",
      "relatedTerms": ["Traição", "Trinta Moedas", "Suicídio"]
    },
    {
      "id": "maria_madalena_088",
      "word": "MARIA MADALENA",
      "hint": "Mulher de quem Jesus expulsou sete demônios, primeira testemunha da ressurreição",
      "fullExplanation": "Maria Madalena (de Magdala) foi liberta por Jesus de sete demônios, tornando-se sua seguidora. Esteve presente na crucificação e sepultamento. No domingo, foi ao túmulo de madrugada, encontrou-o vazio, e correu avisar Pedro e João. Voltando, chorou fora do túmulo, viu dois anjos, depois Jesus, a quem confundiu com jardineiro. Quando Jesus a chamou pelo nome, reconheceu-o e exclamou 'Rabôni!' (Mestre). Jesus disse: 'Não me detenhas... mas vai a meus irmãos'. Tornou-se 'apóstola aos apóstolos' anunciando a ressurreição.",
      "funFact": "Maria Madalena foi erroneamente identificada com a pecadora que ungiu Jesus (Lucas 7) e Maria de Betânia! Essa confusão surgiu no século VI com o Papa Gregório. Na verdade, era discípula proeminente. 'Noli me tangere' (não me toques) na Vulgata levou a muitas interpretações artísticas.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["mulher", "discípula", "ressurreição", "testemunha", "Madalena"],
      "imageUrl": "/images/mary-magdalene.png",
      "relatedTerms": ["Ressurreição", "Testemunha", "Discípula"]
    },
    {
      "id": "maria_mae_089",
      "word": "MARIA",
      "hint": "Virgem que concebeu Jesus pelo Espírito Santo",
      "fullExplanation": "Maria, jovem virgem de Nazaré, noiva de José, foi visitada pelo anjo Gabriel que anunciou que conceberia pelo Espírito Santo e daria à luz o Filho do Altíssimo. Respondeu: 'Eis aqui a serva do Senhor; cumpra-se em mim segundo a tua palavra'. Visitou Isabel, profetizou no Magnificat. Deu à luz em Belém, apresentou Jesus no Templo, fugiu para Egito, voltou a Nazaré. Preocupada quando Jesus aos 12 ficou no Templo. Instou Jesus nas bodas de Caná. Esteve ao pé da cruz, onde Jesus a confiou a João. Perseverou em oração com os discípulos após ascensão.",
      "funFact": "Maria é a única pessoa presente em ambos nascimento e morte de Jesus! Seu canto (Magnificat) ecoa o de Ana (1 Samuel 2). 'Cheia de graça' (kecharitomene) no anúncio angelical significa 'altamente favorecida'. Venerada no catolicismo e ortodoxia, respeitada no protestantismo. Mencionada pela última vez em Atos 1:14.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["mãe", "Jesus", "virgem", "anjo", "magnificat"],
      "imageUrl": "/images/mary-mother.png",
      "relatedTerms": ["Jesus", "Anunciação", "Magnificat"]
    },
    {
      "id": "marta_090",
      "word": "MARTA E MARIA",
      "hint": "Irmãs de Lázaro com personalidades diferentes diante de Jesus",
      "fullExplanation": "Marta e Maria eram irmãs de Lázaro de Betânia, amigas de Jesus. Na visita de Jesus, Marta ocupava-se com muitos serviços, enquanto Maria sentava-se aos pés de Jesus ouvindo sua palavra. Marta queixou-se: 'Senhor, não te importas que minha irmã me deixe servir sozinha?'. Jesus respondeu: 'Marta, Marta, andas inquieta e te preocupas com muitas coisas; entretanto, pouco é necessário, ou mesmo uma só coisa; Maria, pois, escolheu a boa parte, e esta não lhe será tirada'. Marta também fez confissão de fé: 'Creio que tu és o Cristo, o Filho de Deus' (João 11:27).",
      "funFact": "Betânia significa 'casa dos pobres' ou 'casa de tâmaras'! Ficava a 3km de Jerusalém, no caminho para Jericó. Jesus frequentemente se hospedava lá. Marta é a forma feminina de 'senhor' (mar). A cena ilustra tensão entre ação e contemplação na vida espiritual.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["mulheres", "irmãs", "Jesus", "serviço", "escuta"],
      "imageUrl": "/images/martha-mary.png",
      "relatedTerms": ["Maria de Betânia", "Betânia", "Serviço"]
    },
    {
      "id": "lazaro_091",
      "word": "LAZARO",
      "hint": "Homem que Jesus ressuscitou após quatro dias morto",
      "fullExplanation": "Lázaro, irmão de Marta e Maria de Betânia, adoeceu e morreu. Jesus, estando distante, disse: 'Esta enfermidade não é para morte, mas para glória de Deus'. Chegou quando Lázaro já estava quatro dias no túmulo. Marta disse: 'Senhor, se estiveras aqui, meu irmão não teria morrido'. Jesus chorou. Diante do túmulo, ordenou: 'Tirai a pedra'. Orou ao Pai, então clamou: 'Lázaro, vem para fora!'. Lázaro saíu envolto em faixas. Muitos creram, mas autoridades planejaram matar Jesus e Lázaro. Referido como 'aquele a quem amas'.",
      "funFact": "A ressurreição de Lázaro é o último e maior sinal no Evangelho de João, precipitando a decisão de matar Jesus! 'Jesus chorou' (João 11:35) é o versículo mais curto da Bíblia. O período de quatro dias significava decomposição avançada na crença judaica - milagre ainda maior.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["ressurreição", "milagre", "Betânia", "amigo", "Jesus"],
      "imageUrl": "/images/lazarus.png",
      "relatedTerms": ["Ressurreição", "Betânia", "Milagre"]
    },
    {
      "id": "stephen_092",
      "word": "ESTÊVÃO",
      "hint": "Primeiro mártir cristão, apedrejado após discurso acusatório",
      "fullExplanation": "Estêvão foi um dos sete diáconos escolhidos para servir mesas na igreja primitiva, cheio de fé e do Espírito Santo. Fazia grandes prodígios. Debates com sinagogas helenistas levaram a acusações falsas de blasfêmia contra Moisés e Deus. Perante o Sinédrio, seu rosto parecia de anjo. Fez longo discurso revisando história de Israel, acusando-os de resistir ao Espírito como seus pais, e vendo Jesus à direita de Deus. Irado, arrastaram-no para fora, apedrejaram. Ele orou: 'Senhor, não lhes imputes este pecado'. Testemunhas deixaram mantos aos pés de Saulo (Paulo).",
      "funFact": "O martírio de Estêvão ocorreu por volta de 34-35 d.C.! Sua visão do céu aberto e Jesus à direita de Deus ecoa a de Jesus perante o Sinédrio. Seu perdão aos executores ecoa Jesus na cruz. Saulo (Paulo) consentiu na morte - impacto profundo na vida de Paulo.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["mártir", "diácono", "discurso", "apedrejamento", "perdão"],
      "imageUrl": "/images/stephen.png",
      "relatedTerms": ["Mártir", "Diácono", "Perdão"]
    },
    {
      "id": "filipe_evangelista_093",
      "word": "FELIPE",
      "hint": "Diácono que evangelizou o eunuco etíope e Samaria",
      "fullExplanation": "Filipe foi um dos sete diáconos (Atos 6:5). Após a dispersão por perseguição, pregou em Samaria com grande poder, realizando milagres, e Simão, o mágico, se converteu. Um anjo o enviou ao caminho de Gaza, onde encontrou um eunuco etíope, alto oficial de Candace, lendo Isaías 53. Filipe perguntou: 'Compreendes o que lês?'. Explicou que Isaías falava de Jesus, batizou o eunuco, que seguiu alegre. Filipe foi 'arrebatado' pelo Espírito para Azoto, evangelizando cidades até Cesareia, onde depois hospedou Paulo (Atos 21:8). Tinha quatro filhas profetisas.",
      "funFact": "Filipe evangelizou o primeiro africano registrado no NT! O eunuco era provavelmente prosélito ou temente a Deus, impedido de plena conversão ao judaísmo por ser eunuco (Deuteronômio 23:1). Filipe demonstrou que em Cristo essas barreiras caem (Isaías 56:3-5).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["diácono", "evangelista", "eunuco", "Samaria", "batismo"],
      "imageUrl": "/images/philip.png",
      "relatedTerms": ["Diácono", "Eunuco", "Evangelismo"]
    },
    {
      "id": "cornelio_094",
      "word": "CORNÉLIO",
      "hint": "Centurião romano cuja conversão abriu evangelho aos gentios",
      "fullExplanation": "Cornélio, centurião da coorte Italiana em Cesareia, piedoso e temente a Deus com toda sua casa, dava esmolas e orava. Teve visão de anjo dizendo para mandar buscar Pedro em Jope. Enquanto isso, Pedro em Jope teve visão de lençol com animais impuros e voz: 'Mata e come'. Recusou três vezes. Então homens de Cornélio chegaram. Espírito disse a Pedro para ir com eles. Encontrando Cornélio e sua assembleia, Pedro compreendeu: 'Deus não faz acepção de pessoas'. Pregou Jesus, o Espírito caiu sobre todos, foram batizados. Evento crucial para aceitar gentios sem circuncisão.",
      "funFact": "Cornélio era 'temente a Deus' - gentil simpatizante do judaísmo que não se circuncidara! Sua conversão forçou a igreja primitiva a reconhecer que Deus dava Espírito Santo a gentios igualmente. Pedro foi criticado em Jerusalém por entrar em casa de incircuncisos, mas justificou-se.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["gentio", "centurião", "conversão", "Pedro", "visão"],
      "imageUrl": "/images/cornelius.png",
      "relatedTerms": ["Gentio", "Pedro", "Conversão"]
    },
    {
      "id": "silas_095",
      "word": "SILAS",
      "hint": "Companheiro de Paulo em viagens missionárias e coautor de cartas",
      "fullExplanation": "Silas (Silvano) era líder na igreja de Jerusalém, profeta, escolhido para levar decisão do Concílio aos gentios (Atos 15). Junto com Judas Barsabás, encorajou igrejas. Tornou-se companheiro de Paulo após separação de Barnabé e Marcos. Presos em Filipos após expulsar espírito de adivinhação de escrava, cantaram na prisão à meia-noite, terremoto abriu prisão, carcereiro se converteu. Autoridades pediram desculpas ao saber que eram romanos. Com Paulo em Tessalônica, Bereia, Atenas, Corinto. Coautor de 1 e 2 Tessalonicenses. Também associado a Pedro (1 Pedro 5:12).",
      "funFact": "Silas era cidadão romano como Paulo! Seu nome latino Silvanus significa 'da floresta'. Cantar na prisão à meia-noite mostra fé sob pressão. O carcereiro de Filipos e sua família foram batizados na mesma noite - primeiro convertidos europeus de Paulo.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["companheiro", "Paulo", "missionário", "prisão", "cantor"],
      "imageUrl": "/images/silas.png",
      "relatedTerms": ["Paulo", "Missões", "Cântico"]
    },
    {
      "id": "timoteo_096",
      "word": "TIMÓTEO",
      "hint": "Jovem pastor discípulo de Paulo, destinatário de duas cartas",
      "fullExplanation": "Timóteo era filho de mãe judia crente (Eunice) e pai grego, de Listra. Convertido durante primeira viagem missionária de Paulo. Circuncidado por Paulo para ministrar a judeus. Tornou-se companheiro íntimo, 'filho na fé'. Enviado em missões delicadas (Corinto, Tessalônica). Coautor de seis cartas paulinas. Paulo o deixou em Éfeso para pastorear. Recebeu duas cartas pastorais com instruções sobre liderança, doutrina, falsos mestres. Paulo elogia sua fé sincera, herdada de avó Loide e mãe. Timídico, com problemas digestivos (1 Timóteo 5:23). Preso brevemente (Hebreus 13:23).",
      "funFact": "Timóteo conhecia as Escrituras desde a infância (2 Timóteo 3:15)! Seu nome significa 'honrador de Deus'. Paulo o chamou de 'meu amado e fiel filho no Senhor'. Segundo tradição, tornou-se bispo de Éfeso e foi martirizado sob Domiciano (c. 97 d.C.).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["discípulo", "Paulo", "pastor", "jovem", "fé"],
      "imageUrl": "/images/timothy.png",
      "relatedTerms": ["Paulo", "Pastor", "Discípulo"]
    },
    {
      "id": "apolo_097",
      "word": "APOLO",
      "hint": "Judeu eloquente de Alexandria que pregava sobre Jesus",
      "fullExplanation": "Apolo era judeu de Alexandria, eloquente, poderoso nas Escrituras, instruído no caminho do Senhor, fervoroso de espírito, ensinando com precisão sobre Jesus, mas conhecia apenas o batismo de João. Áquila e Priscila o tomaram consigo, explicaram mais precisamente o caminho de Deus. Ele ajudou muito os crentes na Acaia, refutando vigorosamente judeus publicamente, provando pelas Escrituras que Jesus era o Cristo. Alguns coríntios se diziam 'de Apolo', causando divisões. Paulo disse: 'Eu plantei, Apolo regou, mas Deus deu o crescimento'. Apolo recusou voltar a Corinto quando Paulo pediu.",
      "funFact": "Apolo era contemporâneo de Filo de Alexandria - possível influência da filosofia alexandrina! Sua eloquência contrastava com a aparência física fraca de Paulo (2 Coríntios 10:10). Tornou-se símbolo do intelectual cristão. Aparentemente cooperou posteriormente com Paulo (Tito 3:13).",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["pregador", "eloquente", "Alexandria", "Áquila", "divisões"],
      "imageUrl": "/images/apollos.png",
      "relatedTerms": ["Áquila e Priscila", "Eloquência", "Batismo"]
    },
    {
      "id": "aquila_priscila_098",
      "word": "ÁQUILA E PRISCILA",
      "hint": "Casal de fabricantes de tendas que hospedou Paulo e ensinou Apolo",
      "fullExplanation": "Áquila (judeu) e Priscila (ou Prisca) eram casal fabricante de tendas, expulsos de Roma por édito de Cláudio contra judeus (49 d.C.). Paulo, também fabricante de tendas, ficou com eles em Corinto, trabalhando juntos. Acompanharam Paulo a Éfeso, onde instruíram Apolo mais precisamente. Sua casa funcionava como igreja (Romanos 16:5, 1 Coríntios 16:19). Arriscaram a vida por Paulo (Romanos 16:4). Retornaram a Roma após morte de Cláudio. Paulo os saúda calorosamente. Priscila frequentemente mencionada primeiro, sugerindo proeminência. Exemplo de ministério conjugal.",
      "funFact": "Priscila é uma das poucas mulheres mencionadas como ensinadoras no NT! O casal é mencionada seis vezes, sempre juntos. O édito de Cláudio é confirmado pelo historiador Suetônio. 'Priscila' é diminutivo de 'Prisca'. Sua casa-igreja era modelo de igreja doméstica primitiva.",
      "difficulty": "medium",
      "category": "Novo Testamento",
      "tags": ["casal", "tendas", "hospedeiros", "ensinadores", "igreja doméstica"],
      "imageUrl": "/images/aquila-priscilla.png",
      "relatedTerms": ["Casal", "Igreja Doméstica", "Tendas"]
    },
    {
      "id": "herodes_099",
      "word": "HERODES",
      "hint": "Família de reis clientes de Roma mencionados no NT",
      "fullExplanation": "Vários Herodes aparecem no NT: Herodes, o Grande (reinou 37-4 a.C.) - ordenou massacre dos inocentes em Belém; Herodes Arquelau (etnarca da Judeia 4 a.C.-6 d.C.) - motivo para José ir a Nazaré; Herodes Antipas (tetrarca da Galileia 4 a.C.-39 d.C.) - executou João Batista, zombou de Jesus durante julgamento; Herodes Filipe (tetrarca de Itureia) - marido de Herodias que deixou por Antipas; Herodes Agripa I (rei 37-44 d.C.) - matou Tiago, preso Pedro, morreu comido de vermes; Herodes Agripa II (rei 48-93 d.C.) - ouviu defesa de Paulo. Dinastia idumeia convertida ao judaísmo, impopular.",
      "funFact": "Herodes, o Grande, reconstruiu magníficamente o Templo, levando 46 anos (João 2:20)! Era paranóico, matando esposa e filhos. Arqueologia confirma sua grandiosidade. Herodes Antipas fundou Tiberíades. Agripa I tinha neto que era amigo do historiador Flávio Josefo.",
      "difficulty": "advanced",
      "category": "Novo Testamento",
      "tags": ["rei", "dinastia", "política", "mencionado", "governante"],
      "imageUrl": "/images/herod.png",
      "relatedTerms": ["Herodes, o Grande", "Herodes Antipas", "Agripa"]
    },
    {
      "id": "pilatos_100",
      "word": "PÔNCIO PILATOS",
      "hint": "Governador romano que condenou Jesus à crucificação",
      "fullExplanation": "Pôncio Pilatos foi prefeito da Judeia (26-36 d.C.) sob Tibério. Jesus foi levado a ele pelos líderes judeus. Pilatos interrogou, disse: 'Não acho crime algum neste homem'. Ofereceu soltá-lo por ocasião da Páscoa, mas multidão pediu Barrabás. Enviou Jesus a Herodes Antipas, que o devolveu. Lavou as mãos dizendo: 'Estou inocente do sangue deste justo'. Açoitou Jesus, entregou para crucificação. Inscrição na cruz: 'Jesus Nazareno, Rei dos Judeus'. Sua esposa avisou por sonho. Posteriormente, removido por massacre de samaritanos. Tradição diz que se suicidou.",
      "funFact": "O 'Atos de Pilatos' é documento apócrifo! A inscrição INRI (Iesus Nazarenus Rex Iudaeorum) zombava de aspirações judaicas. A pia onde lavou as mãos é mostrada em Roma. Filósofo Fílon descreve Pilatos como cruel e corrupto. O Credo menciona: 'padeceu sob Pôncio Pilatos'.",
      "difficulty": "easy",
      "category": "Novo Testamento",
      "tags": ["governador", "romano", "julgamento", "crucificação", "lavar mãos"],
      "imageUrl": "/images/pilate.png",
      "relatedTerms": ["Julgamento", "Crucificação", "INRI"]
    }
  ]
}