{
  "id": "biology",
  "name": "🧬 Biologia Celular",
  "description": "Explore o mundo microscópico das células, organelas e processos vitais que sustentam a vida",
  "icon": "🔬",
  "color": "green",
  "difficulty": "intermediate",
  "wordCount": 100,
  "categories": ["ciencias", "biologia", "vestibular", "enem"],
  "author": "BioLearn Institute",
  "createdAt": "2024-01-15T10:30:00.000Z",
  "updatedAt": "2024-01-23T14:15:00.000Z",
  "rating": 4.8,
  "reviewCount": 124,
  "terms": [
    {
      "id": "mitocondria_001",
      "word": "MITOCONDRIA",
      "hint": "Organela responsável pela produção de energia na célula",
      "fullExplanation": "A mitocôndria é conhecida como a 'casinha de força' da célula. É uma organela dupla-membranada onde ocorre a respiração celular aeróbica, especificamente o ciclo de Krebs e a cadeia transportadora de elétrons, produzindo ATP (adenosina trifosfato) - a moeda energética da célula. Possui seu próprio DNA circular e ribossomos, evidenciando sua origem endossimbiótica a partir de bactérias ancestrais.",
      "funFact": "As mitocôndrias possuem DNA materno, sendo herdadas exclusivamente da mãe. Além disso, a teoria endossimbiótica sugere que elas eram organismos independentes que foram incorporados por células eucarióticas há bilhões de anos!",
      "difficulty": "medium",
      "category": "Organelas Celulares",
      "tags": ["organela", "energia", "respiração", "ATP", "DNA"],
      "imageUrl": "/images/mitochondria.png",
      "relatedTerms": ["ATP", "Respiração Celular", "DNA Mitocondrial"]
    },
    {
      "id": "ribossomo_002",
      "word": "RIBOSSOMO",
      "hint": "Estrutura celular responsável pela síntese de proteínas",
      "fullExplanation": "Os ribossomos são complexos ribonucleoproteicos (RNA + proteínas) que realizam a tradução do RNA mensageiro (mRNA) em cadeias polipeptídicas. Podem ser encontrados livres no citoplasma (produzindo proteínas para uso interno) ou associados ao retículo endoplasmático rugoso (produzindo proteínas para secreção ou membrana). São compostos por duas subunidades (maior e menor) que se unem durante o processo de tradução.",
      "funFact": "Os ribossomos são tão essenciais que são encontrados em todos os domínios da vida - Archaea, Bacteria e Eukarya. Muitos antibióticos, como a estreptomicina e tetraciclina, atuam especificamente nos ribossomos bacterianos, inibindo a síntese proteica sem afetar os ribossomos humanos!",
      "difficulty": "medium",
      "category": "Organelas Celulares",
      "tags": ["organela", "proteína", "síntese", "tradução", "RNA"],
      "imageUrl": "/images/ribosome.png",
      "relatedTerms": ["RNA Mensageiro", "Tradução", "Retículo Endoplasmático"]
    },
    {
      "id": "nucleo_003",
      "word": "NÚCLEO",
      "hint": "Estrutura que contém o material genético da célula eucariótica",
      "fullExplanation": "O núcleo é a organela mais proeminente da célula eucariótica, delimitada pelo envelope nuclear (dupla membrana com poros nucleares). Contém o DNA organizado em cromossomos durante a divisão celular e em cromatina durante a interfase. É responsável pelo controle das atividades celulares através da expressão gênica, além de abrigar o nucléolo (local de produção dos ribossomos).",
      "funFact": "O núcleo foi a primeira organela a ser descrita cientificamente! Antonie van Leeuwenhoek observou o 'lúmen' (núcleo) em células de salmão em 1676, mas apenas em 1831 Robert Brown deu o nome 'núcleo' e reconheceu sua importância universal nas células eucarióticas.",
      "difficulty": "easy",
      "category": "Organelas Celulares",
      "tags": ["organela", "DNA", "genética", "cromossomo", "eucarioto"],
      "imageUrl": "/images/nucleus.png",
      "relatedTerms": ["DNA", "Cromossomo", "Envelope Nuclear"]
    },
    {
      "id": "cloroplasto_004",
      "word": "CLOROPLASTO",
      "hint": "Organela onde ocorre a fotossíntese nas células vegetais",
      "fullExplanation": "Os cloroplastos são organelas presentes em células vegetais e algas, delimitados por dupla membrana e contendo tilacoides empilhados em granum, imersos no estroma. Contêm clorofila e outros pigmentos fotossintéticos que captam energia luminosa, convertendo-a em energia química (ATP e NADPH) através das reações luminosas. No estroma ocorre o ciclo de Calvin, fixando CO₂ em carboidratos.",
      "funFact": "Assim como as mitocôndrias, os cloroplastos têm origem endossimbiótica! Acredita-se que ancestrais das plantas engoliram cianobactérias fotossintetizantes, que evoluíram para cloroplastos. Eles ainda possuem DNA circular próprio e se dividem independentemente da célula!",
      "difficulty": "medium",
      "category": "Organelas Celulares",
      "tags": ["organela", "fotossíntese", "planta", "clorofila", "energia"],
      "imageUrl": "/images/chloroplast.png",
      "relatedTerms": ["Fotossíntese", "Clorofila", "Tilacoide"]
    },
    {
      "id": "lisossomo_005",
      "word": "LISOSSOMO",
      "hint": "Organela responsável pela digestão intracelular",
      "fullExplanation": "Os lisossomos são vesículas membranosas que contêm enzimas digestivas (hidrolases ácidas) capazes de digerir diversos tipos de biomoléculas (proteínas, lipídios, carboidratos, ácidos nucleicos). Atuam na reciclagem de componentes celulares desgastados (autofagia), digestão de partículas englobadas por fagocitose ou pinocitose, e na defesa contra patógenos. Mantêm pH ácido (~4.5-5.0) ideal para atividade enzimática.",
      "funFact": "As enzimas lisossômicas são tão poderosas que, se liberadas no citoplasma, digeririam toda a célula em minutos! Por isso são mantidas isoladas em compartimentos membranosos. Doenças de armazenamento lisossômico, como a doença de Tay-Sachs, ocorrem quando há deficiência de enzimas específicas.",
      "difficulty": "medium",
      "category": "Organelas Celulares",
      "tags": ["organela", "digestão", "enzima", "autofagia", "fagocitose"],
      "imageUrl": "/images/lysosome.png",
      "relatedTerms": ["Enzima", "Autofagia", "Fagocitose"]
    },
    {
      "id": "retículo_endoplasmático_006",
      "word": "RETÍCULO ENDOPLASMÁTICO",
      "hint": "Rede de membranas envolvida na síntese e transporte de proteínas e lipídios",
      "fullExplanation": "O retículo endoplasmático (RE) é um sistema contínuo de membranas formando cisternas, túbulos e vesículas. Divide-se em RE rugoso (com ribossomos aderidos, especializado em síntese e processamento de proteínas para secreção ou membrana) e RE liso (sem ribossomos, envolvido na síntese de lipídios, detoxificação e estoque de cálcio). É fundamental para a biogênese de membranas e compartimentalização celular.",
      "funFact": "O retículo endoplasmático ocupa até 50% do volume celular em algumas células especializadas! Nas células do fígado (hepatócitos), o RE liso é abundantíssimo para detoxificação de drogas e álcool. Em células do pâncreas exócrino, o RE rugoso é extremamente desenvolvido para produção de enzimas digestivas.",
      "difficulty": "advanced",
      "category": "Organelas Celulares",
      "tags": ["organela", "proteína", "lipídio", "membrana", "transporte"],
      "imageUrl": "/images/endoplasmic-reticulum.png",
      "relatedTerms": ["Ribossomo", "Complexo de Golgi", "Membrana Plasmática"]
    },
    {
      "id": "complexo_golgi_007",
      "word": "COMPLEXO DE GOLGI",
      "hint": "Organela responsável pelo processamento, empacotamento e distribuição de proteínas",
      "fullExplanation": "O complexo de Golgi consiste em pilhas de cisternas achatadas (dictiossomos) com polaridade definida: face cis (recebe vesículas do RE), região medial (processamento) e face trans (expede vesículas). Modifica proteínas e lipídios através de glicosilação, sulfatação e fosforilação; classifica moléculas para diferentes destinos (lisossomos, membrana plasmática, secreção); e forma vesículas de transporte. É o 'centro de distribuição' celular.",
      "funFact": "Descoberto por Camillo Golgi em 1898 usando sua técnica de impregnação pela prata, o aparelho de Golgi gerou controvérsia por décadas sobre ser real ou artefato! Apenas com o microscópio eletrônico na década de 1950 sua existência foi incontestavelmente confirmada.",
      "difficulty": "medium",
      "category": "Organelas Celulares",
      "tags": ["organela", "processamento", "empacotamento", "glicosilação", "vesícula"],
      "imageUrl": "/images/golgi-apparatus.png",
      "relatedTerms": ["Retículo Endoplasmático", "Vesícula", "Secreção Celular"]
    },
    {
      "id": "atp_008",
      "word": "ATP",
      "hint": "Molécula que armazena e fornece energia para processos celulares",
      "fullExplanation": "A adenosina trifosfato (ATP) é um nucleotídeo composto por adenina, ribose e três grupos fosfato. A hidrólise da ligação entre os fosfatos β e γ libera aproximadamente 7,3 kcal/mol, tornando-a a principal 'moeda energética' da célula. É constantemente regenerada a partir de ADP + Pi através da fosforilação oxidativa (mitocôndrias), fotofosforilação (cloroplastos) e fosforilação ao nível do substrato (glicólise).",
      "funFact": "Uma célula humana consome e regenera seu peso equivalente em ATP a cada dia! Um adulto em repouso utiliza cerca de 40 kg de ATP diariamente, mas o pool celular é apenas cerca de 50 gramas - cada molécula de ATP é reciclada cerca de 1000 vezes por dia!",
      "difficulty": "medium",
      "category": "Bioquímica Celular",
      "tags": ["energia", "nucleotídeo", "metabolismo", "hidrólise", "fosforilação"],
      "imageUrl": "/images/atp.png",
      "relatedTerms": ["Mitocôndria", "Respiração Celular", "ADP"]
    },
    {
      "id": "citoesqueleto_009",
      "word": "CITOESQUELETO",
      "hint": "Rede de filamentos que dá forma e permite movimento à célula",
      "fullExplanation": "O citoesqueleto é uma rede tridimensional de proteínas filamentosas presentes no citoplasma, composta por microtúbulos, microfilamentos (filamentos de actina) e filamentos intermediários. Fornece estrutura e mantém a forma celular, permite movimento celular e intramolecular, auxilia na divisão celular, no transporte vesicular e na organização de outras organelas. Proporciona características dinâmicas à célula, permitindo deformações e movimentos variados.",
      "funFact": "Os microtúbulos podem crescer e encolher rapidamente, mudando de comprimento em minutos! Essa característica dinâmica permite que a célula rapidamente reorganize seu citoesqueleto em resposta a sinais externos. A cadeína, uma proteína que quebra microtúbulos, é alvo de muitos medicamentos anticâncer!",
      "difficulty": "medium",
      "category": "Estrutura Celular",
      "tags": ["estrutura", "movimento", "proteína", "microtúbulo", "actina"],
      "imageUrl": "/images/cytoskeleton.png",
      "relatedTerms": ["Microtúbulo", "Actina", "Centrossomo"]
    },
    {
      "id": "membrana_plasmatica_010",
      "word": "MEMBRANA PLASMÁTICA",
      "hint": "Bicamada lipídica que envolve e protege a célula",
      "fullExplanation": "A membrana plasmática é uma estrutura semipermeável que envolve toda a célula, composta principalmente por bicamada fosfolipídica com proteínas (periféricas e transmembranares) e colesterol. Controla a entrada/saída de substâncias, medeia comunicação celular, reconhecimento, adesão e processos de endocitose/exocitose. Sua fluidez varia com a composição de lipídios e temperatura, sendo essencial para a viabilidade celular.",
      "funFact": "A membrana plasmática é incrivelmente fina - cerca de 7-10 nm! Se a célula fosse do tamanho de uma bola de futebol, a membrana teria apenas a espessura de um filme plástico fino. Apesar dessa delgadez, ela pode suportar as forças de pressão osmótica sem romper-se.",
      "difficulty": "medium",
      "category": "Estrutura Celular",
      "tags": ["membrana", "fosfolipídio", "proteína", "semipermeável", "transporte"],
      "imageUrl": "/images/cell-membrane.png",
      "relatedTerms": ["Fosfolipídio", "Proteína Transmembranar", "Osmose"]
    },
    {
      "id": "dna_011",
      "word": "DNA",
      "hint": "Molécula que contém a informação genética hereditária",
      "fullExplanation": "O ácido desoxirribonucleico (DNA) é um polímero de nucleotídeos (desoxirribose + fosfato + base nitrogenada: A, T, G, C) que forma uma dupla hélice. Contém os genes que codificam proteínas e regulam processos celulares. Nas células eucarióticas, está principalmente no núcleo (DNA nuclear), mas também em mitocôndrias e cloroplastos. É capaz de replicação semi-conservativa, permitindo transmissão hereditária de informações.",
      "funFact": "Se desenrolarmos todo o DNA presente em uma única célula humana, ele teria cerca de 2 metros de comprimento! No entanto, consegue se empacotar em um núcleo de apenas 10 mícrons de diâmetro através de empacotamento hierárquico com histonas e cromatina.",
      "difficulty": "medium",
      "category": "Genética",
      "tags": ["genética", "molécula", "hereditário", "gene", "dupla-hélice"],
      "imageUrl": "/images/dna.png",
      "relatedTerms": ["RNA", "Gene", "Cromossomo"]
    },
    {
      "id": "rna_012",
      "word": "RNA",
      "hint": "Molécula que transcreve e traduz a informação genética do DNA",
      "fullExplanation": "O ácido ribonucleico (RNA) é um polímero de nucleotídeos (ribose + fosfato + base nitrogenada: A, U, G, C) tipicamente monocatenário. Existem três tipos principais: mRNA (transporta informação do DNA para ribossomos), tRNA (transporta aminoácidos aos ribossomos) e rRNA (componente ribossomal). Pode também funcionar como enzima (ribozimas) e ter papel regulatório (microRNA). É sintetizado através da transcrição do DNA.",
      "funFact": "Alguns RNAs atuam como enzimas, cortando e ligando outras moléculas! Esses RNAs catalíticos, chamados ribozimas, foram descobertos na década de 1980 e revolucionaram a compreensão sobre evolução - sugerem que em uma 'RNA world' primitiva, RNA podia tanto armazenar informação quanto catalizar reações.",
      "difficulty": "medium",
      "category": "Genética",
      "tags": ["genética", "molécula", "transcrição", "tradução", "ribossomal"],
      "imageUrl": "/images/rna.png",
      "relatedTerms": ["DNA", "Transcrição", "Tradução"]
    },
    {
      "id": "fotossintese_013",
      "word": "FOTOSSÍNTESE",
      "hint": "Processo que converte luz solar em energia química para produzir açúcares",
      "fullExplanation": "A fotossíntese é o processo através do qual plantas, algas e alguns procariontes convertem energia luminosa em energia química (ATP e NADPH), utilizando esses compostos para fixar CO₂ em carboidratos. Ocorre em dois estágios: reações luminosas (no tilacoide, produzem ATP e NADPH liberando O₂) e reações escuras ou ciclo de Calvin (no estroma, usam ATP/NADPH para fixar CO₂ em glicose).",
      "funFact": "A fotossíntese é a reação mais importante para a vida na Terra! Ela produz praticamente todo o oxigênio que respiramos e fixa carbono inorgânico em forma orgânica que alimenta praticamente todas as cadeias alimentares. Sem fotossíntese, a vida tal como conhecemos não existiria.",
      "difficulty": "advanced",
      "category": "Bioenergética",
      "tags": ["energia", "processo", "luz", "cloroplasto", "plantas"],
      "imageUrl": "/images/photosynthesis.png",
      "relatedTerms": ["Cloroplasto", "Ciclo de Calvin", "Reações Luminosas"]
    },
    {
      "id": "respiracao_celular_014",
      "word": "RESPIRAÇÃO CELULAR",
      "hint": "Processo que libera energia através da quebra de moléculas de glicose",
      "fullExplanation": "A respiração celular é o processo através do qual as células extraem energia de moléculas orgânicas (principalmente glicose), convertendo-a em ATP. Pode ser aeróbica (com oxigênio: glicólise + ciclo de Krebs + cadeia respiratória) ou anaeróbica (sem oxigênio: fermentação). A respiração aeróbica é muito mais eficiente, produzindo até 38 ATP por glicose, enquanto a anaeróbica produz apenas 2.",
      "funFact": "Um ser humano queima cerca de 40 kg de glicose por dia, mesmo em repouso! Aproximadamente 60% da energia produzida é liberada como calor corporal, mantendo a temperatura em torno de 37°C. O restante é convertido em ATP para realizar trabalho celular.",
      "difficulty": "advanced",
      "category": "Bioenergética",
      "tags": ["energia", "metabolismo", "glicose", "ATP", "mitocôndria"],
      "imageUrl": "/images/cellular-respiration.png",
      "relatedTerms": ["Glicólise", "Ciclo de Krebs", "Mitocôndria"]
    },
    {
      "id": "glicólise_015",
      "word": "GLICÓLISE",
      "hint": "Primeira etapa da respiração celular que quebra glicose em piruvato",
      "fullExplanation": "A glicólise é a via metabólica que converte glicose em dois piruvatoatos, produzindo 2 ATP líquido e 2 NADH. Ocorre no citoplasma em 10 reações enzimáticas sucessivas. Não requer oxigênio (é anaeróbica) e é a única via de produção energética em células sem mitocôndrias. O piruvato pode então ser oxidado no ciclo de Krebs (se houver oxigênio) ou convertido em lactato via fermentação anaeróbica.",
      "funFact": "A glicólise é uma das vias metabólicas mais antigas e conservadas! Mesmo em bactérias primitivas essa via está presente praticamente inalterada. A conservação ao longo de bilhões de anos de evolução demonstra sua eficácia e importância fundamental.",
      "difficulty": "advanced",
      "category": "Bioenergética",
      "tags": ["metabolismo", "glicose", "energia", "citoplasma", "piruvato"],
      "imageUrl": "/images/glycolysis.png",
      "relatedTerms": ["Respiração Celular", "Ciclo de Krebs", "Fermentação"]
    },
    {
      "id": "cromossomo_016",
      "word": "CROMOSSOMO",
      "hint": "Estrutura que contém genes e é formada por DNA e proteínas",
      "fullExplanation": "Cromossomos são estruturas altamente compactadas de DNA ligado a proteínas (histonas principalmente), visíveis ao microscópio durante divisão celular. Cada cromossomo contém muitos genes. Humanos têm 46 cromossomos (23 pares) no núcleo celular. Os cromossomos homólogos herdam-se de ambos os pais, enquanto cromossomos sexuais (X e Y) determinam o sexo.",
      "funFact": "Se esticarmos os cromossomos de uma célula humana, teriam uma extensão equivalente à distância da Terra ao Sol (150 milhões de km)! Apesar dessa extensão gigantesca, conseguem se empacotar em um núcleo microscópico sem emaranhar-se, graças a uma organização hierárquica perfeita.",
      "difficulty": "easy",
      "category": "Genética",
      "tags": ["genética", "DNA", "gene", "hélio", "divisão"],
      "imageUrl": "/images/chromosome.png",
      "relatedTerms": ["DNA", "Gene", "Núcleo"]
    },
    {
      "id": "gene_017",
      "word": "GENE",
      "hint": "Unidade hereditária de DNA que codifica uma proteína",
      "fullExplanation": "Um gene é um segmento de DNA que contém informação para produzir uma proteína específica ou regular funções celulares. Consiste em regiões codificadoras (éxons) e não-codificadoras (íntrons). Através do processo de transcrição e tradução, a informação genética é convertida em proteínas. Múltiplas alelos de um gene podem existir numa população, causando variação genética.",
      "funFact": "O Projeto Genoma Humano descobriu que temos apenas cerca de 20-25 mil genes! Isso foi uma surpresa, pois esperava-se muito mais. Além disso, 98,5% do nosso DNA não codifica proteínas - grande parte dessa 'DNA lixo' tem funções regulatórias.",
      "difficulty": "easy",
      "category": "Genética",
      "tags": ["genética", "DNA", "proteína", "hereditário", "alelo"],
      "imageUrl": "/images/gene.png",
      "relatedTerms": ["Cromossomo", "DNA", "Transcrição"]
    },
    {
      "id": "proteina_018",
      "word": "PROTEÍNA",
      "hint": "Molécula que executa a maioria das funções celulares",
      "fullExplanation": "Proteínas são polímeros de aminoácidos ligados por ligações peptídicas. Constituem a maioria das estruturas celulares e catalisam reações metabólicas (enzimas). Têm múltiplas funções: estrutural, catalítica, transporte, regulatória, defesa. Sua estrutura tridimensional determina sua função. Sintetizadas nos ribossomos pela tradução do mRNA.",
      "funFact": "Existem cerca de 100 mil proteínas diferentes no corpo humano! Cada uma com estrutura única e função específica. A estrutura tridimensional correta é crucial - apenas uma mudança de um aminoácido pode causar doenças sérias como fibrose cística ou doença falciforme.",
      "difficulty": "easy",
      "category": "Bioquímica Celular",
      "tags": ["proteína", "aminoácido", "enzima", "estrutura", "função"],
      "imageUrl": "/images/protein.png",
      "relatedTerms": ["Aminoácido", "Enzima", "Ribossomo"]
    },
    {
      "id": "enzima_019",
      "word": "ENZIMA",
      "hint": "Proteína que catalisa reações bioquímicas aumentando sua velocidade",
      "fullExplanation": "Enzimas são proteínas com atividade catalítica que aceleram reações químicas sem serem consumidas. Atuam por baixar a energia de ativação da reação. Cada enzima é específica para um substrato ou tipo de reação. Possuem um sítio ativo onde o substrato se liga. Podem ser reguladas alostericamente ou por modificação covalente, permitindo que a célula controle o fluxo metabólico.",
      "funFact": "Algumas enzimas são incrivelmente eficientes! A catalase quebra peróxido de hidrogênio (H₂O₂) em água e oxigênio a uma taxa de um milhão de moléculas por segundo. Sem enzimas, as reações químicas da vida levariam anos para ocorrer - com enzimas, ocorrem em milissegundos!",
      "difficulty": "medium",
      "category": "Bioquímica Celular",
      "tags": ["proteína", "catálise", "metabolismo", "sítio-ativo", "reação"],
      "imageUrl": "/images/enzyme.png",
      "relatedTerms": ["Proteína", "Substrato", "Metabolismo"]
    },
    {
      "id": "mitose_020",
      "word": "MITOSE",
      "hint": "Processo de divisão celular que forma duas células-filhas idênticas",
      "fullExplanation": "Mitose é a divisão nuclear que produz duas células-filhas geneticamente idênticas com o mesmo número de cromossomos que a célula-mãe. Divide-se em fases: prófase (cromossomos condensam, forma-se fuso mitótico), metáfase (cromossomos alinhados na placa metafásica), anáfase (cromátides separam-se), telófase (nucléolos reaparecem, cromossomos descondensam). Seguida por citocinese para separar o citoplasma.",
      "funFact": "Seu corpo está fazendo mitose agora mesmo! Você produz aproximadamente 300 bilhões de novas células por dia através de mitose - isso significa que a cada segundo, 3 milhões de suas células se dividem!",
      "difficulty": "medium",
      "category": "Divisão Celular",
      "tags": ["divisão", "célula", "cromossomo", "fuso", "idêntica"],
      "imageUrl": "/images/mitosis.png",
      "relatedTerms": ["Meiose", "Interfase", "Cromossomo"]
    },
    {
      "id": "meiose_021",
      "word": "MEIOSE",
      "hint": "Processo de divisão celular que forma gametas com metade dos cromossomos",
      "fullExplanation": "Meiose é a divisão celular que reduz o número de cromossomos pela metade, produzindo quatro células-filhas haploides (gametas: espermatozoides ou óvulos). Consiste em duas divisões sucessivas (meiose I e II) com recombinação cromossômica (crossing over) na prófase I, aumentando variabilidade genética. Essencial para reprodução sexuada, combinando material genético de dois indivíduos.",
      "funFact": "A meiose é onde ocorre a mágica da variação genética! Através do crossing over (troca de fragmentos entre cromossomos homólogos) e segregação aleatória, cada óvulo ou espermatozoide é geneticamente único. Por isso filhos de mesmos pais não são geneticamente idênticos (exceto gêmeos monozigóticos).",
      "difficulty": "advanced",
      "category": "Divisão Celular",
      "tags": ["divisão", "gameta", "cromossomo", "haplóide", "reprodução"],
      "imageUrl": "/images/meiosis.png",
      "relatedTerms": ["Mitose", "Gameta", "Recombinação Genética"]
    },
    {
      "id": "vesícula_022",
      "word": "VESÍCULA",
      "hint": "Compartimento membranoso pequeno que transporta moléculas entre organelas",
      "fullExplanation": "Vesículas são compartimentos membranosos pequenos que transportam moléculas e materiais entre diferentes organelas e entre organelas e membrana plasmática. Formadas por brotamento de uma organela doadora e fusão com a organela receptora. Constituem o sistema de transporte intracelular. Podem conter enzimas, hormônios, neurotransmissores ou outras moléculas. São essenciais para o tráfego intramolecular.",
      "funFact": "Bilhões de vesículas estão se movimentando dentro de suas células neste exato momento! Essa rede de transporte vesicular é tão complexa que foi comparada a um sistema de tubulação urbano - organelas funcionam como 'edifícios' que enviam e recebem 'entregas' constantemente.",
      "difficulty": "medium",
      "category": "Transporte Celular",
      "tags": ["transporte", "membrana", "organela", "brotamento", "fusão"],
      "imageUrl": "/images/vesicle.png",
      "relatedTerms": ["Exocitose", "Endocitose", "Complexo de Golgi"]
    },
    {
      "id": "centrossomo_023",
      "word": "CENTROSSOMO",
      "hint": "Organela que organiza os microtúbulos e forma o fuso mitótico",
      "fullExplanation": "O centrossomo é uma região pericelular onde os microtúbulos se organizam. Contém um par de centríolos (estruturas cilíndricas compostas de microtúbulos) em ângulo de 90°. Durante divisão celular, os centrossomos duplicam-se e migram para os pólos celulares, originando os pólos do fuso mitótico. Os centríolos também estão associados a cílios e flagelos.",
      "funFact": "Células animais têm centrossomos, mas plantas não! Essa diferença tornou plantas muito mais difíceis de estudar em termos de divisão celular, pois sem centrossomos definidos, a organização do fuso é mais complexa.",
      "difficulty": "medium",
      "category": "Estrutura Celular",
      "tags": ["organela", "centríolo", "microtúbulo", "divisão", "fuso"],
      "imageUrl": "/images/centrosome.png",
      "relatedTerms": ["Centríolo", "Microtúbulo", "Mitose"]
    },
    {
      "id": "citoplasma_024",
      "word": "CITOPLASMA",
      "hint": "Gel aquoso que preenchea célula entre o núcleo e a membrana plasmática",
      "fullExplanation": "O citoplasma é a região entre o núcleo e a membrana plasmática, consistindo de uma matriz aquosa (citosol) contendo água, íons, proteínas solúveis, lipídios e outras moléculas. Também contém o citoesqueleto e organelas. É o sítio de muitas reações metabólicas (glicólise, síntese proteica etc). Seu pH e composição iônica são rigorosamente regulados.",
      "funFact": "O citoplasma não é um gel inerte - é um ambiente extremamente ativo e organizado! Compartimentos do citoplasma próximos a organelas têm composições diferentes daqueles mais afastados. Há até 'rodovias' para transporte rápido de moléculas ao longo de microtúbulos.",
      "difficulty": "easy",
      "category": "Estrutura Celular",
      "tags": ["célula", "protoplasma", "metabolismo", "matriz", "organela"],
      "imageUrl": "/images/cytoplasm.png",
      "relatedTerms": ["Núcleo", "Membrana Plasmática", "Citoesqueleto"]
    },
    {
      "id": "nucleolo_025",
      "word": "NUCLÉOLO",
      "hint": "Região do núcleo onde são sintetizados os ribossomos",
      "fullExplanation": "O nucléolo é uma região do núcleo (não limitada por membrana) especializada na síntese e montagem dos ribossomos. É o local de transcrição dos genes de RNA ribossomal (rRNA) e de montagem das subunidades ribossômicas. Desaparece durante mitose e se reconstrói na telófase. Células com alta demanda proteica (hepatócitos, células pancreáticas) têm nucléolos prominentes.",
      "funFact": "O nucléolo foi uma das primeiras estruturas celulares observadas ao microscópio! Mesmo microscopistas primitivos notavam essa região escura no centro do núcleo, mas sua função foi descoberta apenas no século XX.",
      "difficulty": "medium",
      "category": "Núcleo",
      "tags": ["núcleo", "ribossomo", "RNA", "síntese", "organela"],
      "imageUrl": "/images/nucleolus.png",
      "relatedTerms": ["Ribossomo", "Núcleo", "rRNA"]
    },
    {
      "id": "ciclo_calvin_026",
      "word": "CICLO DE CALVIN",
      "hint": "Reações escuras da fotossíntese que fixam CO₂ em glicose",
      "fullExplanation": "O ciclo de Calvin (reações escuras da fotossíntese) é a série de reações que ocorrem no estroma do cloroplasto usando ATP e NADPH das reações luminosas para fixar CO₂ em moléculas orgânicas. Combina três CO₂ com RuBP (ribulose-1,5-bifosfato) formando compostos intermediários que são reduzidos a gliceraldeído-3-fosfato (G3P), sendo esse o pré-cursor da glicose.",
      "funFact": "O ciclo de Calvin foi descoberto por Melvin Calvin nos anos 1950 usando radioativos - trabalho que lhe rendeu o Prêmio Nobel! A elegância do ciclo é que para produzir uma molécula de G3P, a célula precisa gastar 9 ATP e 6 NADPH - a energia capturada pelas reações luminosas.",
      "difficulty": "advanced",
      "category": "Fotossíntese",
      "tags": ["fotossíntese", "CO2", "glucose", "ATP", "NADPH"],
      "imageUrl": "/images/calvin-cycle.png",
      "relatedTerms": ["Fotossíntese", "Cloroplasto", "Reações Luminosas"]
    },
    {
      "id": "transferencia_energia_027",
      "word": "TRANSFERÊNCIA DE ENERGIA",
      "hint": "Processo onde energia de uma molécula é transferida para outra",
      "fullExplanation": "A transferência de energia entre moléculas é fundamental em biologia. Em organismos, energia luminosa é convertida em energia química (fotossíntese), que é armazenada em ligações químicas de moléculas como ATP e glicose. Essa energia é então liberada conforme necessário através de reações catabólicas como respiração celular. A energia também flui através das cadeias alimentares de organismos produtores para consumidores.",
      "funFact": "A eficiência de transferência de energia entre níveis tróficos é cerca de 10%! Isso significa que se plantas fixam 1000 kcal de energia em um ecossistema, herbívoros conseguem apenas 100 kcal dessa energia, e carnívoros primários conseguem apenas 10 kcal. Por isso há sempre mais plantas que herbívoros, e mais herbívoros que carnívoros.",
      "difficulty": "medium",
      "category": "Bioenergética",
      "tags": ["energia", "transferência", "ATP", "metabolismo", "cadeia-alimentar"],
      "imageUrl": "/images/energy-transfer.png",
      "relatedTerms": ["ATP", "Fotossíntese", "Respiração Celular"]
    },
    {
      "id": "ciclo_krebs_028",
      "word": "CICLO DE KREBS",
      "hint": "Série de reações que libera energia do acetil-CoA na mitocôndria",
      "fullExplanation": "O ciclo de Krebs (ciclo do ácido cítrico ou ciclo de Tricarboxílico) é uma série de 8 reações que ocorrem na matriz mitocondrial, convertendo acetil-CoA em CO₂ e gerando NADH, FADH₂ e GTP. Cada volta do ciclo oxida completamente uma molécula de acetato. O NADH e FADH₂ produzidos alimentam a cadeia de transporte de elétrons, gerando a maioria do ATP. É central no metabolismo.",
      "funFact": "O ciclo de Krebs foi descoberto por Sir Hans Adolf Krebs, que ganhou o Prêmio Nobel em 1953 por essa descoberta! O ciclo havia sido parcialmente descoberto antes, mas Krebs conectou todas as reações em um ciclo coerente - uma das descobertas mais importantes da bioquímica.",
      "difficulty": "advanced",
      "category": "Bioenergética",
      "tags": ["metabolismo", "respiração", "mitocôndria", "energia", "oxidação"],
      "imageUrl": "/images/krebs-cycle.png",
      "relatedTerms": ["Piruvato", "Acetil-CoA", "NADH"]
    },
    {
      "id": "cadeia_respiratoria_029",
      "word": "CADEIA RESPIRATÓRIA",
      "hint": "Série de proteínas que transferem elétrons e gera ATP na mitocôndria",
      "fullExplanation": "A cadeia de transporte de elétrons (cadeia respiratória) é uma série de proteínas transmembranares na membrana interna mitocondrial que transferem elétrons de NADH e FADH₂ para oxigênio, produzindo uma gradiente de prótons. Esse gradiente é usado pela ATP sintase para fosforilar ADP em ATP. É onde a maioria do ATP (cerca de 30-32 de 38 ATP) é produzida na respiração aeróbica.",
      "funFact": "Cianeto é um veneno tão mortífero porque bloqueia a cadeia respiratória no complexo IV! Sem essa última etapa, toda a cadeia para, células não conseguem fazer ATP, e morte celular ocorre em minutos. Outros tóxicos ambientais também afetam componentes da cadeia respiratória.",
      "difficulty": "advanced",
      "category": "Bioenergética",
      "tags": ["respiração", "mitocôndria", "ATP", "elétron", "oxigênio"],
      "imageUrl": "/images/respiratory-chain.png",
      "relatedTerms": ["NADH", "Oxigênio", "ATP Sintase"]
    },
    {
      "id": "fermentacao_030",
      "word": "FERMENTAÇÃO",
      "hint": "Processo anaeróbico que regenera NAD+ permitindo continuação da glicólise",
      "fullExplanation": "Fermentação é a oxidação anaeróbica de glicose a ácido láctico (fermentação láctica) ou etanol (fermentação alcoólica), regenerando NAD+ para permitir que a glicólise continue na ausência de oxigênio. Produz apenas 2 ATP por glicose (vs. 38 na respiração aeróbica). Importante em músculos durante exercício intenso (fermentação láctica), em leveduras (fermentação alcoólica) e em bactérias anaeróbicas.",
      "funFact": "A sensação de queimação nos músculos durante exercício intenso não é causada por ácido láctico acumulado, como pensava-se antes! Na verdade, o ácido láctico é removido rapidamente. A queimação é causada por outros fatores como depleção de fosfato inorgânico e bloqueio de cálcio. O ácido láctico é na verdade uma fonte de energia importante!",
      "difficulty": "medium",
      "category": "Bioenergética",
      "tags": ["metabolismo", "anaeróbico", "glicose", "NAD", "ATP"],
      "imageUrl": "/images/fermentation.png",
      "relatedTerms": ["Glicólise", "Ácido Láctico", "Etanol"]
    },
    {
      "id": "autofagia_031",
      "word": "AUTOFAGIA",
      "hint": "Processo celular onde a célula digere suas próprias organelas desgastadas",
      "fullExplanation": "Autofagia (do grego 'auto' = próprio, 'phagia' = comer) é um mecanismo de degradação e reciclagem de componentes celulares. A célula envolve estruturas desgastadas em vesículas duplo-membranares (autofagossomos) que se fundem com lisossomos para digestão. É essencial para remover organelas danificadas, limpar agregados proteicos e manter a qualidade citoplásmica. Também funciona como mecanismo de sobrevivência durante estresse ou fome.",
      "funFact": "Yoshinori Ohsumi ganhou o Prêmio Nobel de 2016 por descobrir mecanismos de autofagia! Curiosamente, trabalhou por 40 anos de forma pouco reconhecida, estudando autofagia em leveduras em um pequeno laboratório. Sua dedição exemplifica a importância da pesquisa persistente.",
      "difficulty": "advanced",
      "category": "Processos Celulares",
      "tags": ["digestão", "reciclagem", "organela", "lisossomo", "degradação"],
      "imageUrl": "/images/autophagy.png",
      "relatedTerms": ["Lisossomo", "Degradação", "Estresse Celular"]
    },
    {
      "id": "apoptose_032",
      "word": "APOPTOSE",
      "hint": "Morte celular programada controlada que elimina células danificadas",
      "fullExplanation": "Apoptose é a morte celular programada, um processo controlado onde a célula se auto-destrói de forma ordenada sem danificar células vizinhas. Ativada por sinais internos (dano ao DNA, estresse) ou externos (sinais morte), leva à fragmentação nuclear, condensação de cromatina e formação de corpos apoptóticos. É essencial para desenvolvimento, homeostase tecidual e eliminação de células cancerosas.",
      "funFact": "Sem apoptose, seríamos muito estranhos! Durante desenvolvimento embrionário, apoptose 'esculpe' estruturas - por exemplo, os dedos se formam porque a membrana interdigital morre por apoptose. Também elimina células do sistema imunológico que poderiam atacar nosso próprio corpo.",
      "difficulty": "advanced",
      "category": "Processos Celulares",
      "tags": ["morte", "programada", "DNA", "desenvolvimento", "homeostase"],
      "imageUrl": "/images/apoptosis.png",
      "relatedTerms": ["Morte Celular", "Desenvolvimento", "Câncer"]
    },
    {
      "id": "homeostase_033",
      "word": "HOMEOSTASE",
      "hint": "Capacidade do organismo de manter ambiente interno estável",
      "fullExplanation": "Homeostase é a tendência dos sistemas biológicos de manter condições internas relativamente constantes. Envolve múltiplos mecanismos de feedback que regulam temperatura, pH, osmolaridade, níveis de glicose, oxigênio etc. Quando parâmetros saem do normal, sensores detectam o desvio e acionam respostas compensatórias (feedback negativo). É fundamental para funcionamento dos organismos.",
      "funFact": "Claude Bernard (1813-1878) propôs o conceito de 'milieu intérieur' (ambiente interno), precursor da homeostase! Ele reconheceu que organismos multicelulares precisam manter um ambiente interno estável para as células funcionarem. Este conceito revolucionário, elaborado depois por Walter Cannon, é central em fisiologia.",
      "difficulty": "medium",
      "category": "Fisiologia",
      "tags": ["equilíbrio", "feedback", "regulação", "ambiente", "estabilidade"],
      "imageUrl": "/images/homeostasis.png",
      "relatedTerms": ["Feedback Negativo", "Regulação", "Temperatura Corporal"]
    },
    {
      "id": "osmose_034",
      "word": "OSMOSE",
      "hint": "Movimento de água através de membrana semipermeável de região mais diluída para mais concentrada",
      "fullExplanation": "Osmose é o movimento espontâneo de solvente (usualmente água) através de membrana semipermeável de uma região com menor concentração de soluto para maior concentração. Não requer energia. É acionada pela diferença de potencial osmótico entre dois compartimentos. Fundamental para regulação de volume e turgor celular, absorção de água em raízes de plantas.",
      "funFact": "Você enrugaria rapidamente em piscina sem osmose! Se a água pudesse entrar livremente nas células, incharíamos. A osmose regula isso - nossa pele não é permeável a muitos solutos, então a água entra lentamente. Em água doce, peixes de água doce precisam constantemente excretar água para não inchar.",
      "difficulty": "medium",
      "category": "Transporte Celular",
      "tags": ["transporte", "água", "membrana", "gradiente", "passivo"],
      "imageUrl": "/images/osmosis.png",
      "relatedTerms": ["Membrana Plasmática", "Difusão", "Turgor"]
    },
    {
      "id": "difusao_035",
      "word": "DIFUSÃO",
      "hint": "Movimento espontâneo de moléculas de área concentrada para menos concentrada",
      "fullExplanation": "Difusão é o movimento espontâneo de moléculas ou íons de região com alta concentração para baixa concentração, sem consumo de energia (transporte passivo). Acionada pelo gradiente de concentração e movimento molecular aleatório. É o principal mecanismo para troca de gases entre células e ambiente, absorção de nutrientes e distribuição de moléculas sinalizadoras.",
      "funFact": "A difusão é tão fundamental que até células primitivas contam com ela! Procariotos (bactérias) não têm mitocôndrias nem complexo de Golgi, mas conseguem sobreviver porque moléculas se difundem rapidamente em células pequenas. Em células grandes, difusão seria muito lenta - é por isso que células precisam ser pequenas!",
      "difficulty": "easy",
      "category": "Transporte Celular",
      "tags": ["transporte", "gradiente", "movimento", "passivo", "concentração"],
      "imageUrl": "/images/diffusion.png",
      "relatedTerms": ["Osmose", "Transporte Ativo", "Membrana"]
    },
    {
      "id": "transporte_ativo_036",
      "word": "TRANSPORTE ATIVO",
      "hint": "Movimento de moléculas contra gradiente de concentração usando energia ATP",
      "fullExplanation": "Transporte ativo é o movimento de moléculas ou íons contra seu gradiente de concentração (de menor para maior concentração) usando energia ATP. Requer proteínas transportadoras especializadas (bombas). Exemplos incluem bomba de sódio-potássio (Na+/K+), transporte de glicose em intestinos, acúmulo de íons em vacúolos vegetais.",
      "funFact": "A bomba Na+/K+ consome 25-40% de toda energia ATP do corpo em repouso! Mesmo dormindo, seu corpo está trabalhando para manter gradientes iônicos. Este é um dos principais mecanismos de desperdício calórico não-associado ao exercício.",
      "difficulty": "medium",
      "category": "Transporte Celular",
      "tags": ["transporte", "energia", "ATP", "gradiente", "ativo"],
      "imageUrl": "/images/active-transport.png",
      "relatedTerms": ["ATP", "Difusão", "Bomba de Íons"]
    },
    {
      "id": "endocitose_037",
      "word": "ENDOCITOSE",
      "hint": "Processo donde a célula envolve moléculas externas em vesículas para trazê-las para dentro",
      "fullExplanation": "Endocitose é o processo onde a membrana plasmática envolve materiais externos formando vesículas que são trazidas para o interior da célula. Tipos incluem fagocitose (partículas grandes), pinocitose (líquidos/pequenas moléculas) e endocitose mediada por receptor (moléculas específicas se ligam a receptores). É fundamental para nutrição, defesa imunológica e comunicação celular.",
      "funFact": "Células brancas comem bactérias por fagocitose! Uma célula pode engolfar uma bactéria inteira em uma vesícula e depois digeri-la. Camundongos sem essa capacidade morrem rapidamente de infecção - é tão importante que comprometeu evolutivamente.",
      "difficulty": "medium",
      "category": "Transporte Celular",
      "tags": ["transporte", "vesícula", "membrana", "endocitose", "ingestão"],
      "imageUrl": "/images/endocytosis.png",
      "relatedTerms": ["Exocitose", "Vesícula", "Fagocitose"]
    },
    {
      "id": "exocitose_038",
      "word": "EXOCITOSE",
      "hint": "Processo donde vesículas liberam conteúdo para exterior da célula",
      "fullExplanation": "Exocitose é o processo inverso da endocitose, onde vesículas contendo proteínas, hormônios ou outros produtos celulares se fusionam com a membrana plasmática liberando seu conteúdo para o exterior. É fundamental para secreção de proteínas, liberação de neurotransmissores, hormônios, enzimas digestivas e componentes de matriz extracelular.",
      "funFact": "Neurônios liberam neurotransmissores por exocitose em velocidades incríveis! Uma vesícula pode se fundir com a membrana em milissegundos. Cálcio é o gatilho - quando entra no terminal pré-sináptico, causa exocitose quase instantânea de milhões de moléculas de neurotransmissor.",
      "difficulty": "medium",
      "category": "Transporte Celular",
      "tags": ["transporte", "vesícula", "membrana", "exocitose", "secreção"],
      "imageUrl": "/images/exocytosis.png",
      "relatedTerms": ["Endocitose", "Vesícula", "Neurotransmissor"]
    },
    {
      "id": "sinapse_039",
      "word": "SINAPSE",
      "hint": "Região de contato entre neurônios onde ocorre transmissão de informação",
      "fullExplanation": "Sinapse é a região especializada de contato entre neurônio e neurônio (ou célula muscular/glandular), onde ocorre transmissão de sinais químicos. Consiste em terminal pré-sináptico (libera neurotransmissores), fenda sináptica (espaço entre células) e receptores pós-sinápticos. Sinapses são sítios de plasticidade neural, permitindo aprendizado e memória.",
      "funFact": "Seu cérebro tem cerca de 100 trilhões de sinapses! Cada neurônio forma tipicamente 7.000 sinapses com outros neurônios. Quando você aprende algo novo, novas sinapses se formam e antigas se fortalecem ou enfraquecem - é por isso que repetição melhora aprendizado.",
      "difficulty": "medium",
      "category": "Neurobiologia",
      "tags": ["neurônio", "comunicação", "neurotransmissor", "cérebro", "sinal"],
      "imageUrl": "/images/synapse.png",
      "relatedTerms": ["Neurônio", "Neurotransmissor", "Potencial de Ação"]
    },
    {
      "id": "potencial_acao_040",
      "word": "POTENCIAL DE AÇÃO",
      "hint": "Mudança rápida no potencial elétrico de membrana que propaga sinais neurais",
      "fullExplanation": "Potencial de ação é uma mudança rápida e reversível do potencial de membrana, propagando-se ao longo do neurônio. Fases: repouso (-70mV) → despolarização (influxo Na+) → repolarização (efluxo K+) → hiperpolarização → retorno ao repouso. É gerado pela abertura/fechamento de canais iônicos. Fundamental para transmissão de sinais em nervos e músculos.",
      "funFact": "Neurônios disparam usando praticamente a mesma quantidade de energia que um computador com a mesma capacidade processual! Mas diferente de computadores, neurônios podem aprender e se adaptar. Cérebros biológicos são ainda mais eficientes em energia que máquinas equivalentes.",
      "difficulty": "advanced",
      "category": "Neurobiologia",
      "tags": ["neurônio", "elétrico", "sinal", "membrana", "propagação"],
      "imageUrl": "/images/action-potential.png",
      "relatedTerms": ["Neurônio", "Sinapse", "Canal Iônico"]
    },
    {
      "id": "mutacao_041",
      "word": "MUTAÇÃO",
      "hint": "Alteração permanente na sequência de DNA que pode ser herdada",
      "fullExplanation": "Mutação é qualquer mudança permanente na sequência de DNA. Podem ser: pontuais (substituição de uma base), deleção (perda de nucleotídeos), inserção (adição de nucleotídeos) ou rearranjo (reorganização de segmentos). Causas incluem radiação, químicos mutagênicos, erros na replicação. Podem ser prejudiciais, neutras ou benéficas - são a fonte principal de variação genética e evolução.",
      "funFact": "Você provavelmente tem 50-100 mutações NOVAS que seus pais não tinham! Cada geração acumula novas mutações. Mesmo a maioria das mutações é neutra ou prejudicial, raramente uma é benéfica e se estabelece na população através de seleção natural.",
      "difficulty": "medium",
      "category": "Genética Molecular",
      "tags": ["DNA", "alteração", "genética", "evolução", "variação"],
      "imageUrl": "/images/mutation.png",
      "relatedTerms": ["DNA", "Evolução", "Seleção Natural"]
    },
    {
      "id": "seleção_natural_042",
      "word": "SELEÇÃO NATURAL",
      "hint": "Processo onde organismos com características vantajosas têm mais sucesso reprodutivo",
      "fullExplanation": "Seleção natural é o mecanismo principal da evolução. Organismos com variações genéticas mais adequadas ao ambiente têm maior taxa de sobrevivência e reprodução, passando esses genes para descendentes. Ao longo de gerações, alelos benéficos aumentam em frequência. Diferentes ambientes favorecem diferentes traços, levando a divergência de espécies.",
      "funFact": "Darwin observou isso em tentilhões das Galápagos! Em seca, tentilhões com bicos maiores podiam quebrar sementes duras - haviam mais descendentes com bicos maiores. Quando chuva voltava, o bico voltava a ser médio. Seleção natural age tão rápido que pode ser observada em uma década!",
      "difficulty": "medium",
      "category": "Evolução",
      "tags": ["evolução", "adaptação", "sobrevivência", "reprodução", "genes"],
      "imageUrl": "/images/natural-selection.png",
      "relatedTerms": ["Mutação", "Evolução", "Adaptação"]
    },
    {
      "id": "adaptacao_043",
      "word": "ADAPTAÇÃO",
      "hint": "Característica herdada que melhora a sobrevivência e reprodução em ambiente específico",
      "fullExplanation": "Adaptação é qualquer traço morfológico, fisiológico ou comportamental herdado que aumenta a chance de sobrevivência ou reprodução em um ambiente particular. Evoluem através de seleção natural ao longo de muitas gerações. Exemplos: hemoglobina ao nível do mar vs altitude, pelagem branca em animais árticos, bioluminescência em organismos abissais.",
      "funFact": "Algumas adaptações são tão precisas que parecem impossivelmente complexas! Por exemplo, a estrutura do olho parece muito bem designada - mas também vemos que tem imperfeições (ponto cego, vasos sanguíneos na frente). Se fosse completamente designado, seria melhor. As imperfeições indicam evolução, não design perfeito.",
      "difficulty": "medium",
      "category": "Evolução",
      "tags": ["evolução", "seleção", "ambiente", "traço", "herdado"],
      "imageUrl": "/images/adaptation.png",
      "relatedTerms": ["Seleção Natural", "Evolução", "Especiação"]
    },
    {
      "id": "biodiversidade_044",
      "word": "BIODIVERSIDADE",
      "hint": "Variedade de diferentes espécies, genes e ecossistemas em uma região",
      "fullExplanation": "Biodiversidade refere-se à variedade de vida em múltiplos níveis: genética (variação dentro de espécie), de espécies (número de espécies diferentes) e ecossistêmica (variedade de habitats e comunidades). A Terra abriga aproximadamente 8-9 milhões de espécies. Biodiversidade garante resiliência dos ecossistemas - mais espécies significa mais funções e backup caso uma desapareça.",
      "funFact": "Estamos vivendo uma extinção em massa! Os últimos 40 anos viram declínio de 68% em populações de vertebrados selvagens. A taxa de extinção atual é 1000 vezes maior que a taxa natural pré-humano. Perda de habitat, poluição e mudanças climáticas são os principais culpados.",
      "difficulty": "easy",
      "category": "Ecologia",
      "tags": ["espécie", "variedade", "ecossistema", "habitat", "extinção"],
      "imageUrl": "/images/biodiversity.png",
      "relatedTerms": ["Ecossistema", "Espécie", "Extinção"]
    },
    {
      "id": "ecossistema_045",
      "word": "ECOSSISTEMA",
      "hint": "Comunidade de organismos vivos interagindo com ambiente físico e químico",
      "fullExplanation": "Ecossistema é uma unidade funcional que consiste de organismos vivos (comunidade biótica) e ambiente abiótico não-vivo (solo, clima, luz, água) em uma área específica. Inclui produtores (plantas), consumidores (herbívoros, carnívoros), decompositores e ciclos de nutrientes. Fluxo de energia e ciclo de nutrientes mantêm o ecossistema funcionando.",
      "funFact": "Toda a floresta amazônica é praticamente um ecossistema único! Produz 50% de sua própria chuva através de transpiração. Se alcançar ponto crítico de desmatamento (estimado 20-25%), pode colapsar não em séculos, mas em décadas, transformando-se em savana seca.",
      "difficulty": "easy",
      "category": "Ecologia",
      "tags": ["ambiente", "comunidade", "organismos", "energia", "nutrientes"],
      "imageUrl": "/images/ecosystem.png",
      "relatedTerms": ["Cadeia Alimentar", "Biodiversidade", "Produtores"]
    },
    {
      "id": "cadeiacadeialimentar_046",
      "word": "CADEIA ALIMENTAR",
      "hint": "Sequência de organismos onde cada um serve como alimento para o próximo",
      "fullExplanation": "Cadeia alimentar é a sequência de transferência de energia e nutrientes entre organismos. Começa com produtores (plantas) que capturam energia solar, passa para consumidores primários (herbívoros), secundários (carnívoros pequenos), terciários (carnívoros grandes) e decompositores. Cada nível trófico retém ~10% da energia do nível anterior, o resto é perdido como calor.",
      "funFact": "Você está nível trófico 2.2! Humanos comemos plantas (nível 1) e animais herbívoros (nível 2), então nossa posição média é 2.2. Carnívoros puros são nível trófico mais alto. Isso explica por que precisamos muito mais alimento para sustentar uma população como carnívoros vs vegetarianos.",
      "difficulty": "easy",
      "category": "Ecologia",
      "tags": ["energia", "alimentação", "transferência", "trófico", "consumidor"],
      "imageUrl": "/images/food-chain.png",
      "relatedTerms": ["Teia Alimentar", "Produtor", "Consumidor"]
    },
    {
      "id": "fotossintese_c3_047",
      "word": "FOTOSSÍNTESE C3",
      "hint": "Via metabólica fotossintética que produz inicialmente ácido 3-fosfoglicérico",
      "fullExplanation": "Fotossíntese C3 é a via fotossintética mais comum onde CO₂ se combina com RuBP (ribulose-1,5-bifosfato) formando primeiro ácido 3-fosfoglicérico (3-PG, composto com 3 carbonos). Presente na maioria das plantas (plantas C3). Menos eficiente em climas quentes/secos pois estômatos fecham reduzindo CO₂, causando fotorrespiração - desperdício de ATP e NADPH.",
      "funFact": "Trigo, arroz, soja, batata são plantas C3 - alimentam 80% da humanidade! Apesar de menos eficientes, dominam porque evoluíram primeiro. Algumas plantas desenvolveram alternativas (C4, CAM) para climas extremos, mas C3 permanece evolutivamente bem-sucedida.",
      "difficulty": "advanced",
      "category": "Fotossíntese",
      "tags": ["fotossíntese", "ciclo", "CO2", "plantas", "carbono"],
      "imageUrl": "/images/c3-photosynthesis.png",
      "relatedTerms": ["Fotossíntese C4", "Fotossíntese CAM", "Ciclo de Calvin"]
    },
    {
      "id": "fotossintese_c4_048",
      "word": "FOTOSSÍNTESE C4",
      "hint": "Via fotossintética modificada que concentra CO₂ para maior eficiência em clima quente",
      "fullExplanation": "Fotossíntese C4 é uma variação onde CO₂ é primeiro fixado em ácido oxalacético (4 carbonos), concentrando CO₂ perto de Rubisco. Adaptação a clima quentes e ensolarados onde fotorrespiração seria severa. Plantas C4 incluem milho, cana-de-açúcar, sorgo. Produzem 50% mais que plantas C3 sob mesmas condições, mas requerem mais energia inicial.",
      "funFact": "Cana-de-açúcar é tão eficiente porque é C4! Por isso é plantada em regiões tropicais - produz quantidades extraordinárias de açúcar. Uma única plantação de cana pode produzir mais energia (bioetanol) por hectare que quase qualquer outro cultivo.",
      "difficulty": "advanced",
      "category": "Fotossíntese",
      "tags": ["fotossíntese", "ciclo", "CO2", "plantas", "quente"],
      "imageUrl": "/images/c4-photosynthesis.png",
      "relatedTerms": ["Fotossíntese C3", "Fotossíntese CAM", "Eficiência"]
    },
    {
      "id": "metabolismo_basal_049",
      "word": "METABOLISMO BASAL",
      "hint": "Quantidade mínima de energia que corpo gasta em repouso para manter funções vitais",
      "fullExplanation": "Metabolismo basal é o gasto energético mínimo de um organismo em repouso, mantendo funções vitais como respiração, circulação, síntese proteica. Depende de massa corporal, idade, sexo, genética e hormônios (principalmente tireóide). Humanos: ~1600-1800 kcal/dia em repouso. Aumenta com músculos (tecido mais metabolicamente ativo), diminui com idade e dieta restritiva.",
      "funFact": "Seu corpo queima calorias mesmo dormindo! De fato, 60-75% do gasto calórico diário é metabolismo basal, não exercício. Por isso quem tem mais músculos queima mais calorias em repouso - músculos são biologicamente 'caros' em termos de energia mesmo parados.",
      "difficulty": "medium",
      "category": "Fisiologia",
      "tags": ["metabolismo", "energia", "repouso", "calorias", "gasto"],
      "imageUrl": "/images/basal-metabolism.png",
      "relatedTerms": ["Energia", "Nutrição", "Hormônios"]
    },
    {
      "id": "imunidade_inata_050",
      "word": "IMUNIDADE INATA",
      "hint": "Sistema de defesa não-específico presente desde nascimento contra patógenos",
      "fullExplanation": "Imunidade inata é o sistema de defesa não-específico, presente em todos os organismos, que responde rapidamente a patógenos desconhecidos. Inclui barreiras físicas (pele, muco), células (macrófagos, neutrófilos), proteínas (complemento, lisozima) e inflamação. Não deixa memória, então responde igual a reinfecções. Trabalha junto com imunidade adaptativa para proteção completa.",
      "funFact": "Árabes há 1000 anos faziam variolação - expunham pessoas a material de infecção leve para desenvolvem imunidade! Jenner depois usou varíola de vaca (vaccine) para criar vacina sem risco. Mas eram trabalhando com imunidade adaptativa sem saber - imunidade inata acontece antes dessa.",
      "difficulty": "medium",
      "category": "Imunologia",
      "tags": ["defesa", "patógeno", "células", "não-específica", "rápida"],
      "imageUrl": "/images/innate-immunity.png",
      "relatedTerms": ["Imunidade Adaptativa", "Macrófago", "Inflamação"]
    }
  ]
}
